/* OID.strings
/*
/* This file maps object identifiers (OIDs) to their corresponding labels.
/* These labels are used when displaying the details of a certificate's contents.
/*
/* NOTE TO LOCALIZERS:
/*
/* All strings in this file should eventually be localized. However, not all of them are
/* currently localizable. Specifically, there are a number of acronymns and abbreviations
/* which still need to be expanded into the corresponding English words. [3751398]
/*
/* Acronymns, such as "RSA," "DES," "X.509," "S/MIME," and so on, should be left alone for now.
/* Abbreviated labels such as "id-aa-dvcs-dvc" should also not be localized if present.


/* Deutsche Telekom */

"06 05 02 82 06 01 0A"			= "Telesec";
"06 06 02 82 06 01 0A 00"		= "Ampliação Telesec";
"06 06 02 82 06 01 0A 01"		= "Mecanismo Telesec";

"06 07 02 82 06 01 0A 01 00"	= "Autenticação Telesec";
"06 08 02 82 06 01 0A 01 00 01"	= "Autenticação de Senha";
"06 08 02 82 06 01 0A 01 00 02" = "Autenticação de Senha Protegida";
"06 08 02 82 06 01 0A 01 00 03" = "Autenticação Unidirecional X.509";
"06 08 02 82 06 01 0A 01 00 04" = "Autenticação Bidirecional X.509";
"06 08 02 82 06 01 0A 01 00 05" = "Autenticação em Três Direções X.509";
"06 08 02 82 06 01 0A 01 00 06" = "Autenticação Unidirecional ISO9798";
"06 08 02 82 06 01 0A 01 00 07" = "Autenticação Bidirecional ISO9798";
"06 08 02 82 06 01 0A 01 00 08" = "Autenticação Telekom";

"06 07 02 82 06 01 0A 01 01"	= "Assinatura Telesec";
"06 08 02 82 06 01 0A 01 01 01"	= "MD4 com RSA e ISO9697";
"06 08 02 82 06 01 0A 01 01 02"	= "MD4 com RSA e Padrão de Assinatura Telesec";
"06 08 02 82 06 01 0A 01 01 03"	= "MD5 com RSA e ISO9697";
"06 08 02 82 06 01 0A 01 01 04"	= "MD5 com RSA e Padrão de Assinatura Telesec";
"06 08 02 82 06 01 0A 01 01 05"	= "RIPEMD-160 com RSA e Padrão de Assinatura Telekom";
"06 08 02 82 06 01 0A 01 01 09"	= "Assinatura HBCI RSA";

"06 07 02 82 06 01 0A 01 02"	= "Criptografia Telesec";
"06 08 02 82 06 01 0A 01 02 00"	= "nenhum";
"06 08 02 82 06 01 0A 01 02 01"	= "RSA Telesec";
"06 08 02 82 06 01 0A 01 02 02"	= "DES";
"06 09 02 82 06 01 0A 01 02 02 01"	= "DES ECB";
"06 09 02 82 06 01 0A 01 02 02 02"	= "DES CBC";
"06 09 02 82 06 01 0A 01 02 02 03"	= "DES OFB";
"06 09 02 82 06 01 0A 01 02 02 04"	= "DES CFB8";
"06 09 02 82 06 01 0A 01 02 02 05"	= "DES CFB64";
"06 08 02 82 06 01 0A 01 02 03"	= "3DES";
"06 09 02 82 06 01 0A 01 02 03 01"	= "3DES ECB";
"06 09 02 82 06 01 0A 01 02 03 02"	= "3DES CBC";
"06 09 02 82 06 01 0A 01 02 03 03"	= "3DES OFB";
"06 09 02 82 06 01 0A 01 02 03 04"	= "3DES CFB8";
"06 09 02 82 06 01 0A 01 02 03 05"	= "3DES CFB64";
"06 08 02 82 06 01 0A 01 02 04"	= "Magenta";
"06 08 02 82 06 01 0A 01 02 05"	= "IDEA";
"06 09 02 82 06 01 0A 01 02 05 01"	= "IDEA ECB";
"06 09 02 82 06 01 0A 01 02 05 02"	= "IDEA CBC";
"06 09 02 82 06 01 0A 01 02 05 03"	= "IDEA OFB";
"06 09 02 82 06 01 0A 01 02 05 04"	= "IDEA CFB8";
"06 09 02 82 06 01 0A 01 02 05 05"	= "IDEA CFB64";

"06 07 02 82 06 01 0A 01 03"	= "Função Unidirecional";
"06 08 02 82 06 01 0A 01 03 01"	= "MD4";
"06 08 02 82 06 01 0A 01 03 02"	= "MD5";
"06 08 02 82 06 01 0A 01 03 03"	= "SqModN-X509";
"06 08 02 82 06 01 0A 01 03 04"	= "SqModN-ISO";
"06 08 02 82 06 01 0A 01 03 05"	= "RIPEMD-128";
"06 08 02 82 06 01 0A 01 03 06"	= "Criptografar usando Cifra de Bloqueio";
"06 08 02 82 06 01 0A 01 03 07"	= "MAC";
"06 08 02 82 06 01 0A 01 03 08"	= "RIPEMD-160";

"06 07 02 82 06 01 0A 01 04"	= "Função FEC";
"06 08 02 82 06 01 0A 01 04 01"	= "Reed Solomon";

"06 06 02 82 06 01 0A 02"		= "Módulo Telesec";
"06 07 02 82 06 01 0A 02 00"	= "Algoritmos";
"06 07 02 82 06 01 0A 02 01"	= "Tipos de Atributo";
"06 07 02 82 06 01 0A 02 02"	= "Tipos de Certificados";
"06 07 02 82 06 01 0A 02 03"	= "Tipos de Mensagem";
"06 07 02 82 06 01 0A 02 04"	= "Protocolo PL";
"06 07 02 82 06 01 0A 02 05"	= "SME e Componentes de SME";
"06 07 02 82 06 01 0A 02 06"	= "FEC";
"06 07 02 82 06 01 0A 02 07"	= "Definições Úteis";
"06 07 02 82 06 01 0A 02 08"	= "Arquivos STE";
"06 07 02 82 06 01 0A 02 09"	= "SAdmin";
"06 07 02 82 06 01 0A 02 0A"	= "Pedido Eletrônico";
"06 07 02 82 06 01 0A 02 0B"	= "Aplicativo Assimétrico Telesec TTP";
"06 07 02 82 06 01 0A 02 0C"	= "Aplicativo com Base em TTP Telesec";
"06 07 02 82 06 01 0A 02 0D"	= "Mensagens TTP Telesec";
"06 07 02 82 06 01 0A 02 0E"	= "Aplicativo de Marcação de Hora TTP Telesec";

"06 06 02 82 06 01 0A 03"		= "Classe de Objeto";
"06 07 02 82 06 01 0A 03 00"	= "Outro Nome Telesec";
"06 07 02 82 06 01 0A 03 01"	= "Diretório";
"06 07 02 82 06 01 0A 03 02"	= "Tipo de Diretório";
"06 07 02 82 06 01 0A 03 03"	= "Grupo de Diretórios";
"06 07 02 82 06 01 0A 03 04"	= "Usuário de Diretório";
"06 07 02 82 06 01 0A 03 05"	= "Entrada de Chave Simétrica";

"06 06 02 82 06 01 0A 04"		= "Pacote";
"06 06 02 82 06 01 0A 05"		= "Parâmetro";
"06 06 02 82 06 01 0A 06"		= "Vinculação de Nomes";
"06 06 02 82 06 01 0A 07"		= "Atributo";
"06 07 02 82 06 01 0A 07 00"	= "Identificador de Grupo de Aplicativos";
"06 07 02 82 06 01 0A 07 01"	= "Tipo de Certificado";
"06 07 02 82 06 01 0A 07 02"	= "Certificado Telesec";
"06 07 02 82 06 01 0A 07 03"	= "Número de Certificado";
"06 07 02 82 06 01 0A 07 04"	= "Lista de Revogação de Certificados";
"06 07 02 82 06 01 0A 07 05"	= "Data de Criação";
"06 07 02 82 06 01 0A 07 06"	= "Emissor";
"06 07 02 82 06 01 0A 07 07"	= "Autoridade de Nomeação";
"06 07 02 82 06 01 0A 07 08"	= "Diretório de Chave Pública";
"06 07 02 82 06 01 0A 07 09"	= "Domínio de Segurança";
"06 07 02 82 06 01 0A 07 0A"	= "Sujeito";
"06 07 02 82 06 01 0A 07 0B"	= "Hora da Revogação";
"06 07 02 82 06 01 0A 07 0C"	= "Referência de Grupo de Usuários";
"06 07 02 82 06 01 0A 07 0D"	= "Validade";
"06 07 02 82 06 01 0A 07 0E"	= "ZERT93";
"06 07 02 82 06 01 0A 07 0F"	= "Ambiente de Mensagem de Segurança";
"06 07 02 82 06 01 0A 07 10"	= "Diretório de Chave Pública Anonimizado";
"06 07 02 82 06 01 0A 07 11"	= "Nome Telesec";
"06 07 02 82 06 01 0A 07 12"	= "Adições de Nome";
"06 07 02 82 06 01 0A 07 13"	= "Código Postal Telesec";
"06 07 02 82 06 01 0A 07 14"	= "Especificador de Nomes";
"06 07 02 82 06 01 0A 07 15"	= "Lista de Certificados Telesec";
"06 07 02 82 06 01 0A 07 16"	= "Lista de Certificados Teletrust";
"06 07 02 82 06 01 0A 07 17"	= "Lista de Certificados X.509";
"06 07 02 82 06 01 0A 07 18"	= "Hora da Emissão";
"06 07 02 82 06 01 0A 07 19"	= "Número do Cartão Físico";
"06 07 02 82 06 01 0A 07 1A"	= "Tipo do Arquivo";
"06 07 02 82 06 01 0A 07 1B"	= "O Arquivo Ctl é um Arquivo";
"06 07 02 82 06 01 0A 07 1C"	= "Endereço de E-mail";
"06 07 02 82 06 01 0A 07 1D"	= "Lista de Modelos de Certificados";
"06 07 02 82 06 01 0A 07 1E"	= "Diretório";
"06 07 02 82 06 01 0A 07 1F"	= "Tipo de Diretório";
"06 07 02 82 06 01 0A 07 20"	= "Grupo de Diretórios";
"06 07 02 82 06 01 0A 07 21"	= "Usuário de Diretório";
"06 07 02 82 06 01 0A 07 22"	= "Sinalização de Revogação";
"06 07 02 82 06 01 0A 07 23"	= "Nome da Entrada de Chave Simétrica";
"06 07 02 82 06 01 0A 07 24"	= "Número GL";
"06 07 02 82 06 01 0A 07 25"	= "Número GO";
"06 07 02 82 06 01 0A 07 26"	= "Dados de Chave G";
"06 07 02 82 06 01 0A 07 27"	= "Dados de Chave Z";
"06 07 02 82 06 01 0A 07 28"	= "Dados de Chave KT";
"06 07 02 82 06 01 0A 07 2A"	= "Número de Chave KT";
"06 07 02 82 06 01 0A 07 33"	= "Hora da Geração de Revogação";
"06 07 02 82 06 01 0A 07 34"	= "Texto de Responsabilidade Legal";

"06 06 02 82 06 01 0A 08"		= "Grupo de Atributos";
"06 06 02 82 06 01 0A 09"		= "Ação";
"06 06 02 82 06 01 0A 0A"		= "Aviso";
"06 06 02 82 06 01 0A 0B"		= "SNMP-MIBS";

"06 07 02 82 06 01 0A 0B 01"	= "Aplicativo de Segurança";

"06 06 02 82 06 01 0A 0C"		= "Definições de Ampliação de Cert. e CRL";

"06 07 02 82 06 01 0A 0C 00"	= "Ampliação da Limitação de Responsabilidade da Ampliação de Cert.";
"06 07 02 82 06 01 0A 0C 01"	= "Ampliação de ID de Certificado Telesec";
"06 07 02 82 06 01 0A 0C 02"	= "Identificador de Políticas Telesec";
"06 07 02 82 06 01 0A 0C 03"	= "ID de Qualificador de Políticas Telesec";
"06 07 02 82 06 01 0A 0C 04"	= "Ampliação Filtrada de CRL Telesec";
"06 07 02 82 06 01 0A 0C 05"	= "Ampliação de Filtro de CRL Telesec";
"06 07 02 82 06 01 0A 0C 06"	= "Ampliação de Autoridade de Nomeação Telesec";

/* RFC 1274 (X.500 attribute collection from the UK, thus the weird OID). */

"06 0A 09 92 26 89 93 F2 2C 64 01 01"	= "ID de Usuário";
"06 0A 09 92 26 89 93 F2 2C 64 01 03"	= "Caixa de Correio RFC822";

/* RFC 2247 */

"06 0A 09 92 26 89 93 F2 2C 64 01 19"	= "Componente de Domínio";

/* Australian Government */

"06 06 2A 24 01 82 4D 01"   = "Número Comercial Australiano";

/* Certificates Australia */

"06 0A 2A 24 A4 97 A3 53 01 64 01 01"	= "Identificador de Políticas de Certificados da Austrália";

/* Signet */

"06 09 2A 24 A0 F2 A0 7D 01 01 02"	= "Signet Pessoal";
"06 09 2A 24 A0 F2 A0 7D 01 01 03"	= "Empresa Signet";
"06 09 2A 24 A0 F2 A0 7D 01 01 04"	= "Signet Legal";
"06 09 2A 24 A0 F2 A0 7D 01 01 0A"	= "Piloto Signet";
"06 09 2A 24 A0 F2 A0 7D 01 01 0B"	= "IntraNet Signet";
"06 09 2A 24 A0 F2 A0 7D 01 01 14"	= "Identificador de Política Signet";

/* Mitsubishi */

"06 0B 2A 83 08 8C 1A 4B 3D 01 01 01"		= "Algoritmo de Criptografia Simétrico";
"06 0C 2A 83 08 8C 9A 4B 3D 01 01 01 01"	= "MISTY1-CBC";

/* SEIS */

"06 05 2A 85 70 22 01"		= "SEIS CP";
"06 06 2A 85 70 22 01 01"	= "Identificador de Política com Alta Garantia SEIS";
"06 06 2A 85 70 22 01 02"	= "Identificador de Política SEIS GAK";
"06 05 2A 85 70 22 02"		= "SEIS PE";
"06 05 2A 85 70 22 03"		= "SEIS AT";
"06 06 2A 85 70 22 03 01"	= "Identificador Pessoal SEIS AT";

/* ANSI X9.57 */

"06 06 2A 86 48 CE 38 01"		= "Módulo X9.57 do ANSI";
"06 07 2A 86 48 CE 38 01 01"	= "Gerenciamento de Certificado X9F1";
"06 06 2A 86 48 CE 38 02"		= "Instrução de Suspensão";
"06 07 2A 86 48 CE 38 02 01"	= "Instrução de Suspensão-Nenhuma";
"06 07 2A 86 48 CE 38 02 02"	= "Emissor";
"06 07 2A 86 48 CE 38 02 03"	= "Rejeitar";
"06 07 2A 86 48 CE 38 02 04"	= "Token de Carga";
"06 06 2A 86 48 CE 38 03"		= "Atributo";
"06 06 2A 86 48 CE 38 03 01"	= "Endosso";
"06 06 2A 86 48 CE 38 03 02"	= "Certificado de Atributo";
"06 06 2A 86 48 CE 38 04"		= "Algoritmo";
"06 07 2A 86 48 CE 38 04 01"	= "DSA";
"06 07 2A 86 48 CE 38 04 02"	= "Combinação DSA";
"06 07 2A 86 48 CE 38 04 03"	= "DSA com SHA-1";

/* ANSI X9.62 */

"06 06 2A 86 48 CE 3D 01"		= "Tipo de Campo X9.62 do ANSI";
"06 07 2A 86 48 CE 3D 01 01"	= "Campo Principal";
"06 07 2A 86 48 CE 3D 01 02"	= "Characteristic-Two Field";
"06 09 2A 86 48 CE 3D 01 02 03"	= "Characteristic-Two Basis";
"06 0A 2A 86 48 CE 3D 01 02 03 01"	= "Base Nula";
"06 0A 2A 86 48 CE 3D 01 02 03 02"	= "Base de Trinômio";
"06 0A 2A 86 48 CE 3D 01 02 03 03"	= "Base Pentanomial";
"06 06 2A 86 48 CE 3D 02"		= "Tipo de Chave Pública";
"06 07 2A 86 48 CE 3D 02 01"	= "Chave Pública de Curva Elíptica";

/* ANSI X9.42 */

"06 06 2A 86 48 CE 3E 01"		= "Tipo de Campo X9.42 do ANSI";
"06 07 2A 86 48 CE 3E 01 01"	= "Campo Galois Principal";
"06 06 2A 86 48 CE 3E 02"		= "Tipo de Número";
"06 07 2A 86 48 CE 3E 02 01"	= "Chave Pública Diffie-Hellman";
"06 06 2A 86 48 CE 3E 03"		= "Esquema";
"06 07 2A 86 48 CE 3E 03 01"	= "Diffie-Hellman Estático";
"06 07 2A 86 48 CE 3E 03 02"	= "Diffie-Hellman Efêmero";
"06 07 2A 86 48 CE 3E 03 03"	= "Diffie-Hellman Híbrido 1";
"06 07 2A 86 48 CE 3E 03 04"	= "Diffie-Hellman Híbrido 2";
"06 07 2A 86 48 CE 3E 03 05"	= "MQV2";
"06 07 2A 86 48 CE 3E 03 06"	= "MQV1";

/* Nortel Secure Networks/Entrust */

"06 07 2A 86 48 86 F6 7D 07"		= "NSN";
"06 08 2A 86 48 86 F6 7D 07 41"		= "NSN-CE";
"06 09 2A 86 48 86 F6 7D 07 41 00"	= "Confiar em Informação de Versão";
"06 08 2A 86 48 86 F6 7D 07 42"		= "NSN-Alg";
"06 09 2A 86 48 86 F6 7D 07 42 03"	= "CAST3-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0A"	= "CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0B"	= "CAST5-MAC";
"06 09 2A 86 48 86 F6 7D 07 42 0C"	= "PBE com MD5 e CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0D"	= "MAC Baseado em Senha";
"06 08 2A 86 48 86 F6 7D 07 43"		= "NSN-OC";
"06 09 2A 86 48 86 F6 7D 07 43 0C"	= "Confiar em Usuário";
"06 08 2A 86 48 86 F6 7D 07 44"		= "NSN-AT";
"06 09 2A 86 48 86 F6 7D 07 44 00"	= "Confiar em Informação de CA";
"06 09 2A 86 48 86 F6 7D 07 44 0A"	= "Certificado de Atributo";

/* PKCS #1 */

"06 08 2A 86 48 86 F7 0D 01 01"		= "PKCS-1";
"06 09 2A 86 48 86 F7 0D 01 01 01"	= "Criptografia ERSA";
"06 09 2A 86 48 86 F7 0D 01 01 02"	= "MD2 com Criptografia RSA";
"06 09 2A 86 48 86 F7 0D 01 01 03"	= "MD4 com Criptografia RSA";
"06 09 2A 86 48 86 F7 0D 01 01 04"	= "MD5 com Criptografia RSA";
"06 09 2A 86 48 86 F7 0D 01 01 05"	= "SHA-1 com Criptografia RSA";
"06 09 2A 86 48 86 F7 0D 01 01 06"	= "Criptografia RSA-OAEP (SET)";
"06 09 2A 86 48 86 F7 0D 01 01 07"	= "Criptografia RSA-OAEP";
"06 09 2A 86 48 86 F7 0D 01 01 08"	= "RSA-OAEP-MGF";
"06 09 2A 86 48 86 F7 0D 01 01 09"	= "RSA-OAEP Especificado por Etiqueta";
"06 09 2A 86 48 86 F7 0D 01 01 0A"	= "Esquema de Assinatura RSA-PSS";
"06 09 2A 86 48 86 F7 0D 01 01 0B"	= "SHA-256 com Criptografia RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0C"	= "SHA-384 com Criptografia RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0D"	= "SHA-512 com Criptografia RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0E"	= "SHA-224 com Criptografia RSA";

/* BSAFE/PKCS #2 (obsolete) */

"06 08 2A 86 48 86 F7 0D 01 02"		= "Criptografia BSAFE RSA";

/* PKCS #3 */

"06 08 2A 86 48 86 F7 0D 01 03"		= "PKCS-3";
"06 09 2A 86 48 86 F7 0D 01 03 01"	= "Acordo de Chave Diffie-Hellman";

/* PKCS #5 */

"06 08 2A 86 48 86 F7 0D 01 05"		= "PKCS-5";
"06 09 2A 86 48 86 F7 0D 01 05 01"	= "PBE com MD2 e DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 03"	= "PBE com MD5 e DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 04"	= "PBE com MD2 e RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 06"	= "PBE with MD5 and RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 09"	= "PBE com MD5 e XOR";
"06 09 2A 86 48 86 F7 0D 01 05 0A"	= "PBE com SHA e DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 0C"	= "PKCS-5 PBKDF2";
"06 09 2A 86 48 86 F7 0D 01 05 0D"	= "PKCS-5 PBES2";
"06 09 2A 86 48 86 F7 0D 01 05 0E"	= "PKCS-5 PBMAC1";

/* PKCS #7 */

"06 08 2A 86 48 86 F7 0D 01 07"		= "PKCS-7";
"06 09 2A 86 48 86 F7 0D 01 07 01"	= "Dados";
"06 09 2A 86 48 86 F7 0D 01 07 02"	= "Dados Assinados";
"06 09 2A 86 48 86 F7 0D 01 07 03"	= "Dados Envelopados";
"06 09 2A 86 48 86 F7 0D 01 07 04"	= "Dados Assinados e Envelopados";
"06 09 2A 86 48 86 F7 0D 01 07 05"	= "Dados Compilados";
"06 09 2A 86 48 86 F7 0D 01 07 06"	= "Dados Criptografados";
"06 09 2A 86 48 86 F7 0D 01 07 07"	= "Dados com Atributos";
"06 09 2A 86 48 86 F7 0D 01 07 08"	= "Informações Criptografadas de Chave Privada";

/* PKCS #9 */

"06 08 2A 86 48 86 F7 0D 01 09"		= "PKCS-9";
"06 09 2A 86 48 86 F7 0D 01 09 01"	= "Endereço de E-mail";
"06 09 2A 86 48 86 F7 0D 01 09 02"	= "Nome Não Estruturado";
"06 09 2A 86 48 86 F7 0D 01 09 03"	= "Tipo de Conteúdo";
"06 09 2A 86 48 86 F7 0D 01 09 04"	= "Compilação de Mensagens";
"06 09 2A 86 48 86 F7 0D 01 09 05"	= "Hora da Autenticação";
"06 09 2A 86 48 86 F7 0D 01 09 06"	= "Endosso";
"06 09 2A 86 48 86 F7 0D 01 09 07"	= "Senha de Autenticação";
"06 09 2A 86 48 86 F7 0D 01 09 08"	= "Endereço Não Estruturado";
"06 09 2A 86 48 86 F7 0D 01 09 09"	= "Atributos de Certificado Ampliado";
"06 09 2A 86 48 86 F7 0D 01 09 0A"	= "Emissor e Número de Série";
"06 09 2A 86 48 86 F7 0D 01 09 0B"	= "Verificação de Senha";
"06 09 2A 86 48 86 F7 0D 01 09 0C"	= "Chave Pública";
"06 09 2A 86 48 86 F7 0D 01 09 0D"	= "Descrição da Autenticação";
"06 09 2A 86 48 86 F7 0D 01 09 0E"	= "Pedido de Ampliação";

/* PKCS #9 for use with S/MIME */

"06 09 2A 86 48 86 F7 0D 01 09 0F"		= "Recursos S/MIME";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 01"	= "Preferir Dados Assinados";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 02"	= "Não é Possível Decriptografar Nenhum";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 03"	= "Pedido de Recibo";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 04"	= "Recibo";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 05"	= "Dicas de Conteúdo";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 06"	= "Histórico de Expansão de Lista de Correio";

"06 09 2A 86 48 86 F7 0D 01 09 10"			= "S/MIME";

/* S/MIME Modules */

"06 0A 2A 86 48 86 F7 0D 01 09 10 00"		= "Módulos S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 01"	= "Sintaxe de Mensagem Criptográfica";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 02"	= "Serviços de Segurança Aprimorados";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 03"	= "Identificador de Objetos S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 04"	= "Mensagem S/MIME V3";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 05"	= "Assinatura Eletrônica ETS 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 06"	= "Assinatura Eletrônica ETS 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 07"	= "Política de Assinatura Eletrônica ETS 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 08"	= "Política de Assinatura Eletrônica ETS 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 09"	= "id-mod-certdist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0A"	= "id-mod-domsec";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0B"	= "id-mod-compress";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0C"	= "id-mod-symkeydist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0D"	= "id-mod-cek-reuse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0E"	= "id-mod-cms-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0F"	= "id-mod-v1AttrCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 10"	= "id-mod-cmsalg-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 11"	= "id-mod-cms-pwri-88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 12"	= "id-mod-cms-pwri-97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 13"	= "id-mod-cms-aes";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 14"	= "id-mod-cms-rsaes-oaep";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 15"	= "id-mod-msg-v3dot1";

/* S/MIME Content Types */

"06 0A 2A 86 48 86 F7 0D 01 09 10 01"		= "Tipos de Conteúdo S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 01"	= "id-ct-receipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 02"	= "id-ct-authData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 03"	= "id-ct-publishCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 04"	= "id-ct-TSTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 05"	= "id-ct-TDTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 06"	= "id-ct-contentInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 07"	= "id-ct-DVCSRequestData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 08"	= "id-ct-DVCSResponseData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 09"	= "id-ct-compressedData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0A"	= "id-ct-svcp-certValRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0B"	= "id-ct-svcp-certValResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0C"	= "id-ct-svcp-valPolRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0D"	= "id-ct-svcp-valPolResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0E"	= "id-ct-attrCertEncAttrs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0F"	= "id-ct-TSReq";

/* S/MIME Authenticated Attributes */

"06 0A 2A 86 48 86 F7 0D 01 09 10 02"		= "Atributos Autenticados S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 01"	= "id-aa-receiptRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 02"	= "id-aa-securityLabel";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 03"	= "id-aa-mlExpandHistory";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 04"	= "id-aa-contentHint";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 05"	= "id-aa-msgSigDigest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 06"	= "id-aa-encapContentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 07"	= "id-aa-contentIdentifier";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 08"	= "id-aa-macValue";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 09"	= "id-aa-equivalentLabels";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0A"	= "id-aa-contentReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0B"	= "id-aa-encrypKeyPref";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0C"	= "id-aa-signingCertificate";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0D"	= "id-aa-smimeEncryptCerts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0E"	= "id-aa-timeStampToken";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0F"	= "id-aa-ets-sigPolicyId";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 10"	= "id-aa-ets-commitmentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 11"	= "id-aa-ets-signerLocation";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 12"	= "id-aa-ets-signerAttr";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 13"	= "id-aa-ets-otherSigCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 14"	= "id-aa-ets-contentTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 15"	= "id-aa-ets-CertificateRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 16"	= "id-aa-ets-RevocationRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 17"	= "id-aa-ets-certValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 18"	= "id-aa-ets-revocationValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 19"	= "id-aa-ets-escTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1A"	= "id-aa-ets-certCRLTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1B"	= "id-aa-ets-archiveTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1C"	= "id-aa-signatureType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1D"	= "id-aa-dvcs-dvc";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1E"	= "id-aa-CEKReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1F"	= "id-aa-maxCEKDecrypts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 20"	= "id-aa-KEKDerivationAlg";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 21"	= "id-aa-intendedRecipients";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 22"	= "id-aa-cmc-unsignedData";

/* S/MIME Algorithms */

"06 0A 2A 86 48 86 F7 0D 01 09 10 03"		= "Algoritmos S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 01"	= "id-alg-ESDHwith3DES";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 02"	= "id-alg-ESDHwithRC2";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 03"	= "id-alg-3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 04"	= "id-alg-RC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 05"	= "id-alg-ESDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 06"	= "id-alg-CMS3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 07"	= "id-alg-CMSRC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 08"	= "id-alg-zlib";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 09"	= "id-alg-PWRI-KEK";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0A"	= "id-alg-SSDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0B"	= "id-alg-HMACwith3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0C"	= "id-alg-HMACwithAESwrap";

/* S/MIME Certificate Distribution */

"06 0A 2A 86 48 86 F7 0D 01 09 10 04"		= "Distribuição de Certificados S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 04 01"	= "Distribuição de Certificados LDAP";

/* S/MIME Signature Policy Qualifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 05"		= "Qualificador de Política de Assinaturas S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 01"	= "id-spq-ets-sqt-uri";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 02"	= "id-spq-ets-sqt-unotice";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 01"	= "id-cti-ets-proofOfOrigin";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 02"	= "id-cti-ets-proofOfReceipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 03"	= "id-cti-ets-proofOfDelivery";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 04"	= "id-cti-ets-proofOfSender";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 05"	= "id-cti-ets-proofOfApproval";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 06"	= "id-cti-ets-proofOfCreation";

/* S/MIME Signature Type Identifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 09"		= "Identificador de Tipo de Assinatura S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 01"	= "Assinatura do Autor";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 02"	= "Assinatura de Domínio";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 03"	= "Assinatura de Atributos Adicionais";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 04"	= "Revisar Assinatura";

/* S/MIME Capabilities */

"06 0A 2A 86 48 86 F7 0D 01 09 10 0B"		= "Recursos S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 0B 01"	= "Preferir Binário Internamente";

/* PKCS #9 for use with PKCS #12 */

"06 09 2A 86 48 86 F7 0D 01 09 14"			= "Nome Amigável (para PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 15"			= "ID de Chave Local (para PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 16"			= "Tipos de Certificados (para PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 01"		= "Certificado X.509 (para PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 02"		= "Certificado SDSI (para PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 17"			= "Tipos de CRL (para PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 17 01"		= "CRL X.509 (para PKCS-12)";

/* PKCS #12 */

"06 08 2A 86 48 86 F7 0D 01 0C"				= "Sintaxe de Intercâmbio de Informações Pessoais PKCS-12";
"06 09 2A 86 48 86 F7 0D 01 0C 01"			= "IDs de Criptografia Baseados em Senha PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 01"		= "PBE com SHA-1 e RC4 de 128-Bits";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 02"		= "PBE com SHA-1 e RC4 de 40-Bits";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 03"		= "PBE com SHA-1 e DES-CBC Triplo de 3 Chaves";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 04"		= "PBE com SHA-1 e DES-CBC Triplo de 2 Chaves";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 05"		= "PBE com SHA-1 e RC2-CBC de 128-Bits";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 06"		= "PBE com SHA-1 e RC2-CBC de 40-Bits";
"06 09 2A 86 48 86 F7 0D 01 0C 02"			= "IDs PKCS-12 ESPVK";
"06 0A 2A 86 48 86 F7 0D 01 0C 02 01"		= "Cobertura de Chave PKCS-12 PKCS-8";
"06 09 2A 86 48 86 F7 0D 01 0C 03"			= "IDs de Bag PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 01"		= "ID de Bag de Chave PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 02"		= "Certificado PKCS-12 e ID de Bag CRL";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 03"		= "ID de Bag Secreto PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 04"		= "ID de Conteúdo Seguro PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 05"		= "ID de Bag de Chave Coberta PKCS-12 PKCS-8";
"06 09 2A 86 48 86 F7 0D 01 0C 04"			= "ID de Bag de Certificados PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 01"		= "ID de Bag de CRL e Certificado PKCS-12 X.509";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 02"		= "ID de Bag de Certificados PKCS-12 SDSI";

"06 09 2A 86 48 86 F7 0D 01 0C 05"			= "PKCS-12 OID";
"06 0A 2A 86 48 86 F7 0D 01 0C 05 01"		= "ID de Criptografia Baseado em Senha PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 01"	= "PKCS-12 PBE com SHA-1 e RC4 de 128 Bits";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 02"	= "PKCS-12 PBE com SHA-1 e RC4 de 40 Bits";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 03"	= "PKCS-12 PBE com SHA-1 e DES-CBC Triplo";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 04"	= "PKCS-12 PBE com SHA-1 e RC2-CBC de 128 Bits";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 05"	= "PKCS-12 PBE com SHA-1 e RC2-CBC de 40 Bits";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 06"	= "PKCS-12 PBE com SHA-1 e RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 07"	= "PKCS-12 PBE com SHA-1 e RC2-CBC";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 02"		= "IDs de Envelopamento PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 01"	= "Criptografia PKCS-12 RSA com RC4 de 128 Bits";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 02"	= "Criptografia PKCS-12 RSA com RC4 de 40 Bits";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 03"	= "Criptografia PKCS-12 RSA com DES Triplo";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 03"		= "ID de Assinatura PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 03 01"	= "Assinatura PKCS-12 RSA com Compilação SHA-1";

"06 09 2A 86 48 86 F7 0D 01 0C 0A"			= "PKCS-12 Versão 1";
"06 0A 2A 86 48 86 F7 0D 01 0C 0A 01"		= "IDs de Bag PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 01"	= "Bag de Chave PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 02"	= "Bag de Chave Coberta PKCS-12 PKCS-8";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 03"	= "Bag de Certificado PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 04"	= "Bag PKCS-12 CRL";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 05"	= "Bag Secreto PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 06"	= "Bag de Conteúdo Seguro PKCS-12";

/* PKCS #15 */

"06 09 2A 86 48 86 F7 0D 01 0F 01"		= "Módulos PKCS-15";
"06 09 2A 86 48 86 F7 0D 01 0F 02"		= "Atributos PKCS-15";
"06 09 2A 86 48 86 F7 0D 01 0F 03"		= "Tipo de Conteúdo PKCS-15";
"06 0A 2A 86 48 86 F7 0D 01 0F 03 01"	= "Conteúdo PKCS-15";

/* RSADSI digest algorithms */

"06 08 2A 86 48 86 F7 0D 02"			= "Algoritmo de Compilação RSADSI";
"06 08 2A 86 48 86 F7 0D 02 02"			= "MD2";
"06 08 2A 86 48 86 F7 0D 02 04"			= "MD4";
"06 08 2A 86 48 86 F7 0D 02 05"			= "MD5";
"06 08 2A 86 48 86 F7 0D 02 07"			= "HMAC com SHA-1";

/* RSADSI encryption algorithms */

"06 08 2A 86 48 86 F7 0D 03"			= "Algoritmo de Criptografia RSADSI";
"06 08 2A 86 48 86 F7 0D 03 02"			= "RC2-CBC";
"06 08 2A 86 48 86 F7 0D 03 03"			= "RC2-ECB";
"06 08 2A 86 48 86 F7 0D 03 04"			= "RC4";
"06 08 2A 86 48 86 F7 0D 03 05"			= "RC4 com MAC";
"06 08 2A 86 48 86 F7 0D 03 06"			= "DESX-CBC";
"06 08 2A 86 48 86 F7 0D 03 07"			= "DES-EDE3-CBC";
"06 08 2A 86 48 86 F7 0D 03 08"			= "RC5-CBC";
"06 08 2A 86 48 86 F7 0D 03 09"			= "Pad RC5-CBC";
"06 08 2A 86 48 86 F7 0D 03 0A"			= "DES-CDMF";

/* Identrus */

"06 09 2A 86 48 86 FA 65 01 06 01"		= "Identificador de política desconhecida Identrus";
"06 08 2A 86 48 86 FA 65 04 01"			= "OCSP de Identrus";

/* Ascom Systech */

"06 0A 2B 06 01 04 01 81 3C 07 01 01"		= "Ascom";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 01"	= "IDEA-ECB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 02"	= "IDEA-CBC";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 03"	= "IDEA-CFB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 04"	= "IDEA-OFB";

/* MIT */

"06 09 2A 86 48 86 F7 12 01 02 02"			= "MIT Kerberos V5";
"06 0A 2A 86 48 86 F7 12 01 02 02 03"		= "Kerberos de Usuário a Usuário do MIT";

/* Microsoft */

"06 09 2A 86 48 82 F7 12 01 02 02"			= "Microsoft Kerberos";

"06 08 2A 86 48 86 F7 14 01 03"				= "Classe de objeto do Microsoft Exchange Server";
"06 09 2A 86 48 86 F7 14 01 03 00"			= "Endereçamento de Site";
"06 09 2A 86 48 86 F7 14 01 03 0D"			= "Esquema de Classe";
"06 09 2A 86 48 86 F7 14 01 03 0E"			= "Esquema de Atributo";
"06 09 2A 86 48 86 F7 14 01 03 11"			= "Caixa de Correio-Agente";
"06 09 2A 86 48 86 F7 14 01 03 16"			= "Caixa de Correio";
"06 09 2A 86 48 86 F7 14 01 03 17"			= "Contêiner";
"06 09 2A 86 48 86 F7 14 01 03 2E"			= "Destinatário de Correio";
"06 09 2A 86 48 86 F7 14 01 02 81 71"		= "Mecanismo de Entrega";

"06 07 2A 86 48 86 F7 14 04"				= "Formatos de arquivo da Microsoft";
"06 08 2A 86 48 86 F7 14 04 02"				= "Microsoft Word";
"06 08 2A 86 48 86 F7 14 04 03"				= "Microsoft Excel";
"06 08 2A 86 48 86 F7 14 04 04"				= "Microsoft Project";
"06 08 2A 86 48 86 F7 14 04 05"				= "Microsoft PowerPoint";
"06 08 2A 86 48 86 F7 14 04 06"				= "Microsoft Works";

"06 08 2B 06 01 04 01 82 37 02"				= "Authenticode";
"06 0A 2B 06 01 04 01 82 37 02 01 04"		= "Contexto de Dados Indireto SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0A"		= "Informações de Agência SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0B"		= "Tipo de Declaração SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0C"		= "Informações de SPC Opus";
"06 0A 2B 06 01 04 01 82 37 02 01 0E"		= "Ampliações de Certificado SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0F"		= "Dados de Imagem de PE SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 14"		= "Link SPC (tipo 1)";
"06 0A 2B 06 01 04 01 82 37 02 01 15"		= "Autenticação de Código Individual";
"06 0A 2B 06 01 04 01 82 37 02 01 16"		= "Autenticação de Código Comercial";
"06 0A 2B 06 01 04 01 82 37 02 01 19"		= "Link SPC (tipo 2)";
"06 0A 2B 06 01 04 01 82 37 02 01 1A"		= "Critérios Mínimos do SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 1B"		= "Critérios Financeiros do SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 1C"		= "Link SPC (tipo 3)";

"06 0A 2B 06 01 04 01 82 37 02 02 0A"		= "Provedor de Suporte de Segurança NTLM";
"06 0A 2B 06 01 04 01 82 37 03 02 01"		= "Endosso de Marcação de Hora";

"06 09 2B 06 01 04 01 82 37 0A 01"			= "Lista de Confiabilidade de Certificados";
"06 0A 2B 06 01 04 01 82 37 0A 01 01"		= "Ampliação de CTL Ordenada";
"06 09 2B 06 01 04 01 82 37 0A 02"			= "Localização da Próxima Atualização";

"06 09 2B 06 01 04 01 82 37 0A 03"			= "Uso de Chave Aprimorado";
"06 0A 2B 06 01 04 01 82 37 0A 03 01"		= "Autenticação de Lista de Confiabilidade de Certificado";
"06 0A 2B 06 01 04 01 82 37 0A 03 02"		= "Autenticação de Marcação de Hora";
"06 0A 2B 06 01 04 01 82 37 0A 03 03"		= "Criptografia com Porta de Servidor";
"06 0B 2B 06 01 04 01 82 37 0A 03 03 01"	= "Criptografia Serializada ";
"06 0A 2B 06 01 04 01 82 37 0A 03 04"		= "Sistemas de Arquivos Encriptados";
"06 0B 2B 06 01 04 01 82 37 0A 03 04 01"	= "Recuperação de Sistemas de Arquivos Criptografados";
"06 0A 2B 06 01 04 01 82 37 0A 03 05"		= "Compatível com Hardware Windows";
"06 0A 2B 06 01 04 01 82 37 0A 03 06"		= "Autenticação NT5";
"06 0A 2B 06 01 04 01 82 37 0A 03 07"		= "Autenticação OEM de Hardware Windows";
"06 0A 2B 06 01 04 01 82 37 0A 03 08"		= "Autenticação NT Integrada";
"06 0A 2B 06 01 04 01 82 37 0A 03 09"		= "Autenticação de Lista Raiz de Confiança";
"06 0A 2B 06 01 04 01 82 37 0A 03 0A"		= "Subordinação Qualificada";
"06 0A 2B 06 01 04 01 82 37 0A 03 0B"		= "Recuperação de Chave";
"06 0A 2B 06 01 04 01 82 37 0A 03 0C"		= "Autenticação de Documento";

"06 09 2B 06 01 04 01 82 37 0A 04"			= "Identificadores de Objeto de Atributo";
"06 0A 2B 06 01 04 01 82 37 0A 04 01"		= "Atributo de Confiabilidade Sim/Não";
"06 0A 2B 06 01 04 01 82 37 0A 05 01"		= "DRM de Música da Microsoft";
"06 0A 2B 06 01 04 01 82 37 0A 05 02"		= "Individualização de DRM da Microsoft";
"06 0A 2B 06 01 04 01 82 37 0A 06 01"		= "Licenças da Microsoft";
"06 0A 2B 06 01 04 01 82 37 0A 06 02"		= "Servidor de Licenças da Microsoft";

"06 08 2B 06 01 04 01 82 37 0D"				= "Identificadores de Objeto Microsoft PKCS-10";
"06 09 2B 06 01 04 01 82 37 0D 01"			= "Certificado de Renovação";
"06 0A 2B 06 01 04 01 82 37 0D 02 01"		= "Emparelhamento de Nome/Valor de Registro";
"06 0A 2B 06 01 04 01 82 37 0D 02 02"		= "CSP de Registro";
"06 0A 2B 06 01 04 01 82 37 0D 02 03"		= "Versão do Sist. Operacional";
"06 08 2B 06 01 04 01 82 37 0F"				= "Microsoft Java";
"06 08 2B 06 01 04 01 82 37 10"				= "Microsoft Outlook/Exchange";
"06 09 2B 06 01 04 01 82 37 10 04"			= "Microsoft Outlook Express";
"06 08 2B 06 01 04 01 82 37 11"				= "Atributos Microsoft PKCS-12";
"06 09 2B 06 01 04 01 82 37 11 01"			= "Conjunto de Chaves da Máquina Local";

"06 08 2B 06 01 04 01 82 37 14"				= "Infraestrutura de Registro da Microsoft";
"06 09 2B 06 01 04 01 82 37 14 01"			= "Uso de CTL de Registro Automático";
"06 09 2B 06 01 04 01 82 37 14 02"			= "Tipo de Certificado de Registro";
"06 0A 2B 06 01 04 01 82 37 14 02 01"		= "Agente de Registro";
"06 0A 2B 06 01 04 01 82 37 14 02 02"		= "Login de Cartão Inteligente";
"06 0A 2B 06 01 04 01 82 37 14 02 03"		= "Nome Principal NT";

"06 08 2B 06 01 04 01 82 37 15"				= "Infraestrutura de Servidor de Certificados da Microsoft";
"06 09 2B 06 01 04 01 82 37 15 01"			= "Versão de Renovação de CA da Microsoft";
"06 08 2B 06 01 04 01 82 37 58"				= "CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 01"			= "Versão CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 02"			= "Atributo CAPICOM";
"06 0A 2B 06 01 04 01 82 37 58 02 01"		= "Nome do Documento";
"06 0A 2B 06 01 04 01 82 37 58 02 02"		= "Descrição do Documento";
"06 09 2B 06 01 04 01 82 37 58 03"			= "Dados Criptografados";
"06 0A 2B 06 01 04 01 82 37 58 03 01"		= "Conteúdo Criptografado";

/* UNINETT */

"06 0A 2B 06 01 04 01 92 7C 0A 01 01"		= "Identificador de Política UNINETT";

/* ICE-TEL */

"06 08 2B 06 01 04 01 95 18 0A"				= "Identificador de Política ICE-TEL";
"06 0A 2B 06 01 04 01 95 62 01 01 01"		= "Identificador de Política de CA ICE-TEL";

/* cryptlib */

"06 0A 2B 06 01 04 01 97 55 01 01 01"		= "Blowfish-ECB";
"06 0A 2B 06 01 04 01 97 55 01 01 02"		= "Blowfish-CBC";
"06 0A 2B 06 01 04 01 97 55 01 01 03"		= "Blowfish-CFB";
"06 0A 2B 06 01 04 01 97 55 01 01 04"		= "Blowfish-OFB";
"06 0A 2B 06 01 04 01 97 55 01 02 01"		= "ElGamal";
"06 0B 2B 06 01 04 01 97 55 01 02 01 01"	= "ElGamal com SHA-1";
"06 0B 2B 06 01 04 01 97 55 01 02 01 02"	= "ElGamal com RIPEMD-160";
"06 09 2B 06 01 04 01 97 55 03 01"			= "Atributos cryptlib";
"06 0A 2B 06 01 04 01 97 55 03 01 01"		= "Verificação de Presença cryptlib";
"06 0A 2B 06 01 04 01 97 55 03 01 02"		= "Resposta OCSP RTCS";
"06 0A 2B 06 01 04 01 97 55 03 01 03"		= "Resposta OCSP RTCS Ampliada";
"06 0A 2B 06 01 04 01 97 55 03 01 04"		= "Razão da CRL Ampliada";
"06 0A 2B 06 01 04 01 97 55 03 01 05"		= "Características da Chave";
"06 0A 2B 06 01 04 01 97 55 03 01 06"		= "Inicialização PKI";
"06 09 2B 06 01 04 01 97 55 04 01"			= "Conteúdo cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 01"		= "Dados de Configuração cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 02"		= "Índice de Usuários cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 03"		= "Informação de Usuários cryptlib";
"06 0B 2B 06 01 04 01 97 55 2A D7 24 01"	= "MPEG-1";
"06 0C 2B 06 01 04 01 97 55 58 59 5A 5A 59"	= "Identificador de Política XYZZY";

/* Timeproof (www.timeproof.de) */

"06 07 2B 06 01 04 01 AA 60"		= "Comprovação horária";
"06 08 2B 06 01 04 01 AA 60 01"		= "Sistema de Assinatura de Hora";
"06 09 2B 06 01 04 01 AA 60 01 01"	= "Sistema de Assinatura de Hora 80";
"06 09 2B 06 01 04 01 AA 60 01 02"	= "Sistema de Assinatura de Hora 380";
"06 09 2B 06 01 04 01 AA 60 01 03"	= "Sistema de Assinatura de Hora 400";

/* MEDePass */

"06 09 2B 06 01 04 01 AD 0A 00 03"  = "Práticas Secundárias";
"06 09 2B 06 01 04 01 AD 0A 00 04"  = "Identificadores de Médico";

/* Kerberos */

"06 05 2B 06 01 05 02"              = "Kerberos v5";
"06 06 2B 06 01 05 02 03"           = "PKINIT Kerberos";
"06 07 2B 06 01 05 02 03 01"        = "Dados de Autenticação Kerberos";
"06 07 2B 06 01 05 02 03 02"        = "Dados de Chave de Kerberos Diffie-Hellman";
"06 07 2B 06 01 05 02 03 03"        = "Dados de Chave de Resposta Kerberos";
"06 07 2B 06 01 05 02 03 04"        = "Autenticação de Cliente Kerberos";
"06 07 2B 06 01 05 02 03 05"        = "Centro de Distribuição de Chaves Kerberos (KDC)";

/* IANA */

"06 06 2B 06 01 05 05 01"			= "Mecanismo de Chave Pública Simples (SPKM)";
"06 06 2B 06 01 05 05 02"			= "SPNEGO";

/* PKIX */

"06 06 2B 06 01 05 05 07"			= "Infraestrutura de Chave Pública";

"06 07 2B 06 01 05 05 07 01"		= "Ampliações de Certificado Privado PKIX";
"06 08 2B 06 01 05 05 07 01 01"		= "Acesso às Informações da Autoridade de Certificação";
"06 08 2B 06 01 05 05 07 01 02"		= "Biometric Information";
"06 08 2B 06 01 05 05 07 01 03"		= "Expressões de Certificado Qualificadas";
"06 08 2B 06 01 05 05 07 01 04"		= "Identidade de Auditoria de Certificado de Atributo";
"06 08 2B 06 01 05 05 07 01 05"		= "Destinação de Certificado de Atributo";
"06 08 2B 06 01 05 05 07 01 06"		= "Controles de Autoridade de Certificação de Atributo";
"06 08 2B 06 01 05 05 07 01 07"		= "Bloqueio de Endereço IP SBGP";
"06 08 2B 06 01 05 05 07 01 08"		= "Identificador de Sistema Autônomo SBGP";
"06 08 2B 06 01 05 05 07 01 09"		= "Identificador de Roteador SBGP";
"06 08 2B 06 01 05 05 07 01 0A"		= "Proxying de Certificado de Atributo";
"06 08 2B 06 01 05 05 07 01 0B"		= "Acesso às Informações do Sujeito";
"06 08 2B 06 01 05 05 07 01 0C"		= "Logotipo";

"06 07 2B 06 01 05 05 07 02"		= "Tipos de Qualificador de Política";
"06 08 2B 06 01 05 05 07 02 01"		= "Declaração de Prática de Certificação";
"06 08 2B 06 01 05 05 07 02 02"		= "Aviso de Usuário";
"06 08 2B 06 01 05 05 07 02 03"		= "Aviso de Texto";

"06 07 2B 06 01 05 05 07 03"		= "Propósito da Chave";
"06 08 2B 06 01 05 05 07 03 01"		= "Autenticação de Servidor";
"06 08 2B 06 01 05 05 07 03 02"		= "Autenticação de Cliente";
"06 08 2B 06 01 05 05 07 03 03"		= "Autenticação de Código";
"06 08 2B 06 01 05 05 07 03 04"		= "Proteção de E-mail";
"06 08 2B 06 01 05 05 07 03 05"		= "Sistema Final IPSEC";
"06 08 2B 06 01 05 05 07 03 06"		= "Túnel IPSEC";
"06 08 2B 06 01 05 05 07 03 07"		= "Usuário IPSEC";
"06 08 2B 06 01 05 05 07 03 08"		= "Marcação de Hora";
"06 08 2B 06 01 05 05 07 03 09"		= "Autenticação OCSP";
"06 08 2B 06 01 05 05 07 03 0A"		= "DVCS";
"06 08 2B 06 01 05 05 07 03 0B"		= "Autenticação de Servidor SBGP AA";

"06 07 2B 06 01 05 05 07 04"		= "Tipos de Informação CMP";
"06 08 2B 06 01 05 05 07 04 01"		= "Certificado de Criptografia de Protocolo da CA";
"06 08 2B 06 01 05 05 07 04 02"		= "Tipos de Emparelhamento de Chave de Autenticação";
"06 08 2B 06 01 05 05 07 04 03"		= "Tipos de Emparelhamento de Chave de Criptografia";
"06 08 2B 06 01 05 05 07 04 04"		= "Algoritmo Simétrico Preferido";
"06 08 2B 06 01 05 05 07 04 05"		= "Informação de Atualização de Chave CA";
"06 08 2B 06 01 05 05 07 04 06"		= "CRL Atual";
"06 08 2B 06 01 05 05 07 04 07"		= "OIDs Incompatíveis";
"06 08 2B 06 01 05 05 07 04 08"		= "Pedido de Assinatura";
"06 08 2B 06 01 05 05 07 04 09"		= "Resposta de Assinatura";
"06 08 2B 06 01 05 05 07 04 0A"		= "Pedido de Parâmetro de Emparelhamento de Chaves";
"06 08 2B 06 01 05 05 07 04 0B"		= "Resposta de Parâmetro de Emparelhamento de Chaves";
/* %%% need to expand these labels, but can't find them documented anywhere online! */
"06 08 2B 06 01 05 05 07 04 0C"		= "revPassphrase";
"06 08 2B 06 01 05 05 07 04 0D"		= "implicitConfirm";
"06 08 2B 06 01 05 05 07 04 0E"		= "confirmWaitTime";
"06 08 2B 06 01 05 05 07 04 0F"		= "origPKIMessage";
"06 08 2B 06 01 05 05 07 04 10"		= "suppLangTags";

"06 07 2B 06 01 05 05 07 05"		= "Registro de CRMF";
"06 08 2B 06 01 05 05 07 05 01"		= "Controle de Registro";
"06 09 2B 06 01 05 05 07 05 01 01"	= "Token de Registro";
"06 09 2B 06 01 05 05 07 05 01 02"	= "Autenticador";
"06 09 2B 06 01 05 05 07 05 01 03"	= "Informação de Publicação PKI";
"06 09 2B 06 01 05 05 07 05 01 04"	= "Opções de Arquivo PKI";
"06 09 2B 06 01 05 05 07 05 01 05"	= "ID de Certificado Antigo";
"06 09 2B 06 01 05 05 07 05 01 06"	= "Chave de Criptografia de Protocolo";
"06 09 2B 06 01 05 05 07 05 01 07"	= "Modelo de Certificado Alternativo";
"06 09 2B 06 01 05 05 07 05 01 08"	= "Modelo WAP WTLS";

"06 08 2B 06 01 05 05 07 05 02"		= "Informações de Registro CRMF";
"06 09 2B 06 01 05 05 07 05 02 01"	= "Pares UTF-8";
"06 09 2B 06 01 05 05 07 05 02 02"	= "Pedido de Certificado";

"06 07 2B 06 01 05 05 07 06"		= "Algoritmos";
"06 08 2B 06 01 05 05 07 06 01"		= "DES-40";
"06 08 2B 06 01 05 05 07 06 02"		= "Nenhuma Assinatura";
"06 08 2B 06 01 05 05 07 06 03"		= "dh-sig-hmac-sha1";
"06 08 2B 06 01 05 05 07 06 04"		= "dh-pop";

"06 07 2B 06 01 05 05 07 07"		= "Controles CMC";

"06 07 2B 06 01 05 05 07 08"		= "Outros Nomes";
"06 08 2B 06 01 05 05 07 08 01"		= "Dados Pessoais";
"06 08 2B 06 01 05 05 07 08 02"		= "Grupo de Usuários";

"06 07 2B 06 01 05 05 07 09"		= "Dados Pessoais";
"06 08 2B 06 01 05 05 07 09 01"		= "Data de Nascimento";
"06 08 2B 06 01 05 05 07 09 02"		= "Local de Nascimento";
"06 08 2B 06 01 05 05 07 09 03"		= "Pseudônimo";
"06 08 2B 06 01 05 05 07 09 04"		= "Gênero";
"06 08 2B 06 01 05 05 07 09 05"		= "Country of Citizenship";
"06 08 2B 06 01 05 05 07 09 06"		= "País de Residência";

"06 07 2B 06 01 05 05 07 0A"		= "Certificado de Atributo";
"06 08 2B 06 01 05 05 07 0A 01"		= "Informação de Autenticação";
"06 08 2B 06 01 05 05 07 0A 02"		= "Identidade de Acesso";
"06 08 2B 06 01 05 05 07 0A 03"		= "Identidade de Cobrança";
"06 08 2B 06 01 05 05 07 0A 04"		= "Grupo";
"06 08 2B 06 01 05 05 07 0A 05"		= "Cargo";
"06 08 2B 06 01 05 05 07 0A 06"		= "WLAN SSID";

/* OCSP */

"06 08 2B 06 01 05 05 07 30 01"		= "Protocolo de Estado de Certificados On-line";
"06 09 2B 06 01 05 05 07 30 01 01"	= "Resposta Básica OCSP";
"06 09 2B 06 01 05 05 07 30 01 02"	= "Ampliação de Nº de Uso Único OCSP";
"06 09 2B 06 01 05 05 07 30 01 03"	= "Referência de CRL OCSP";
"06 09 2B 06 01 05 05 07 30 01 04"	= "Resposta OCSP";
"06 09 2B 06 01 05 05 07 30 01 05"	= "Verificação Sem Revogação de OCSP";
"06 09 2B 06 01 05 05 07 30 01 06"	= "Atalho de Arquivo OCSP";
"06 09 2B 06 01 05 05 07 30 01 07"	= "Localizador de Serviços OCSP";

"06 08 2B 06 01 05 05 07 30 02"		= "Emissores de CA";
"06 08 2B 06 01 05 05 07 30 03"		= "Marcação de Hora";

/* ISAKMP */

"06 08 2B 06 01 05 05 08 01 01"		= "HMAC MD5";
"06 08 2B 06 01 05 05 08 01 02"		= "HMAC SHA-1";
"06 08 2B 06 01 05 05 08 01 03"		= "HMAC Tiger";
"06 08 2B 06 01 05 05 08 02 02"		= "Intermediário IKE";

/* DEC (via ECMA) */

"06 07 2B 0C 02 87 73 07 01"		= "Algoritmo de Criptografia DEC";
"06 08 2B 0C 02 87 73 07 01 02"		= "DEC DEA";
"06 07 2B 0C 02 87 73 07 02"		= "Algoritmo de Criptografia DEC";
"06 07 2B 0C 02 87 73 07 02 01"		= "DEC MD2";
"06 07 2B 0C 02 87 73 07 02 02"		= "DEC MD4";
"06 07 2B 0C 02 87 73 07 03"		= "Algoritmo de Assinatura DEC";
"06 07 2B 0C 02 87 73 07 03 01"		= "DEC MD2 com RSA";
"06 07 2B 0C 02 87 73 07 03 02"		= "DEC MD4 com RSA";
"06 07 2B 0C 02 87 73 07 03 03"		= "DEC DEA-MAC";

/* NIST Open Systems Environment (OSE) Implementor's Workshop (OIW) */

"06 05 2B 0E 02 1A 05"				= "SHA";
"06 06 2B 0E 03 02 01 01"			= "RSA";
"06 05 2B 0E 03 02 02"				= "MD4 com RSA";
"06 05 2B 0E 03 02 03"				= "MD5 com RSA";
"06 05 2B 0E 03 02 04"				= "MD4 com Criptografia RSA";
"06 06 2B 0E 03 02 02 01"			= "SqMod-N";
"06 06 2B 0E 03 02 03 01"			= "SqMod-N com RSA";
"06 05 2B 0E 03 02 06"				= "DES-ECB";
"06 05 2B 0E 03 02 07"				= "DES-CBC";
"06 05 2B 0E 03 02 08"				= "DES-OFB";
"06 05 2B 0E 03 02 09"				= "DES-CFB";
"06 05 2B 0E 03 02 0A"				= "DES-MAC";
"06 05 2B 0E 03 02 0B"				= "Assinatura RSA";
"06 05 2B 0E 03 02 0C"				= "DSA";
"06 05 2B 0E 03 02 0D"				= "DSA com SHA";
"06 05 2B 0E 03 02 0E"				= "MDC2 com Assinatura RSA";
"06 05 2B 0E 03 02 0F"				= "SHA com Assinatura RSA";
"06 05 2B 0E 03 02 10"				= "Diffie-Hellman com Common Modulus";
"06 05 2B 0E 03 02 11"				= "DES-EDE";
"06 05 2B 0E 03 02 12"				= "SHA";
"06 05 2B 0E 03 02 13"				= "MDC-2";
"06 05 2B 0E 03 02 14"				= "DSA Comum";
"06 05 2B 0E 03 02 15"				= "DSA Comum com SHA";
"06 05 2B 0E 03 02 16"				= "Transporte de Chave RSA";
"06 05 2B 0E 03 02 17"				= "Keyed-hash-seal";
"06 05 2B 0E 03 02 18"				= "MD2 com Assinatura RSA";
"06 05 2B 0E 03 02 19"				= "MD5 com Assinatura RSA";
"06 05 2B 0E 03 02 1A"				= "SHA-1";
"06 05 2B 0E 03 02 1B"				= "DSA com SHA-1";
"06 05 2B 0E 03 02 1C"				= "DSA com SHA-1 Comum";
"06 05 2B 0E 03 02 1D"				= "SHA-1 com Criptografia RSA";
"06 05 2B 0E 03 03 01"				= "Simple-strong-auth-mechanism";
"06 06 2B 0E 07 02 01 01"			= "ElGamal";
"06 06 2B 0E 07 02 03 01"			= "MD2 com RSA";
"06 06 2B 0E 07 02 03 02"			= "MD2 com ElGamal";

/* Teletrust */

"06 03 2B 24 01"					= "Documento";
"06 04 2B 24 01 01"					= "Versão Final";
"06 04 2B 24 01 02"					= "Rascunho";
"06 03 2B 24 02"					= "SIO";
"06 04 2B 24 02 01"					= "SEDU";

"06 03 2B 24 03"					= "Algoritmo";
"06 04 2B 24 03 01"					= "Algoritmo de Criptografia";
"06 05 2B 24 03 01 01"				= "DES";
"06 06 2B 24 03 01 01 01"			= "DES-ECB Pad";
"06 07 2B 24 03 01 01 01 01"		= "DES-ECB ISO Pad";
"06 07 2B 24 03 01 01 02 01"		= "DES-CBC Pad";
"06 08 2B 24 03 01 01 02 01 01"		= "DES-CBC ISO Pad";
"06 05 2B 24 03 01 03"				= "DES3";
"06 07 2B 24 03 01 03 01 01"		= "DES3-ECB Pad";
"06 08 2B 24 03 01 03 01 01 01"		= "DES3-ECB ISO Pad";
"06 07 2B 24 03 01 03 02 01"		= "DES3-CBC Pad";
"06 08 2B 24 03 01 03 02 01 01"		= "DES3-CBC ISO Pad";
"06 05 2B 24 03 01 02"				= "IDEA";
"06 06 2B 24 03 01 02 01"			= "IDEA-ECB";
"06 07 2B 24 03 01 02 01 01"		= "IDEA-ECB Pad";
"06 08 2B 24 03 01 02 01 01 01"		= "IDEA-ECB ISO Pad";
"06 06 2B 24 03 01 02 02"			= "IDEA-CBC";
"06 07 2B 24 03 01 02 02 01"		= "IDEA-CBC Pad";
"06 08 2B 24 03 01 02 02 01 01"		= "IDEA-CBC ISO Pad";
"06 06 2B 24 03 01 02 03"			= "IDEA-OFB";
"06 06 2B 24 03 01 02 04"			= "IDEA-CFB";
"06 05 2B 24 03 01 04"				= "Criptografia ERSA";
"06 05 2B 24 03 01 05"				= "BSI-1";
"06 06 2B 24 03 01 05 01"			= "BSI-1-ECB Pad";
"06 06 2B 24 03 01 05 02"			= "BSI-1-CBC Pad";
"06 07 2B 24 03 01 05 02 01"		= "BSI-1-CBC PEM Pad";

"06 04 2B 24 03 02"					= "Algoritmo de Criptografia";
"06 05 2B 24 03 02 01"				= "RIPEMD-160";
"06 05 2B 24 03 02 02"				= "RIPEMD-128";
"06 05 2B 24 03 02 03"				= "RIPEMD-256";
"06 05 2B 24 03 02 04"				= "MDC2 Comprimento Simples";
"06 05 2B 24 03 02 05"				= "MDC2 Comprimento Duplo";
"06 04 2B 24 03 03"					= "Algoritmo de Assinatura";
"06 05 2B 24 03 03 01"				= "Assinatura RSA";

"06 06 2B 24 03 03 01 01"			= "Assinatura RSA com SHA-1";
"06 09 2B 24 03 03 01 01 84 00 02"	= "Assinatura RSA com SHA-1 512/L2";
"06 09 2B 24 03 03 01 01 85 00 02"	= "Assinatura RSA com SHA-1 640/L2";
"06 09 2B 24 03 03 01 01 86 00 02"	= "Assinatura RSA com SHA-1 768/L2";
"06 09 2B 24 03 03 01 01 87 00 02"	= "Assinatura RSA com SHA-1 896/L2";
"06 09 2B 24 03 03 01 01 88 00 02"	= "Assinatura RSA com SHA-1 1024/L2";
"06 09 2B 24 03 03 01 01 84 00 03"	= "Assinatura RSA com SHA-1 512/L3";
"06 09 2B 24 03 03 01 01 85 00 03"	= "Assinatura RSA com SHA-1 640/L3";
"06 09 2B 24 03 03 01 01 86 00 03"	= "Assinatura RSA com SHA-1 768/L3";
"06 09 2B 24 03 03 01 01 87 00 03"	= "Assinatura RSA com SHA-1 896/L3";
"06 09 2B 24 03 03 01 01 88 00 03"	= "Assinatura RSA com SHA-1 1024/L3";
"06 09 2B 24 03 03 01 01 84 00 05"	= "Assinatura RSA com SHA-1 512/L5";
"06 09 2B 24 03 03 01 01 85 00 05"	= "Assinatura RSA com SHA-1 640/L5";
"06 09 2B 24 03 03 01 01 86 00 05"	= "Assinatura RSA com SHA-1 768/L5";
"06 09 2B 24 03 03 01 01 87 00 05"	= "Assinatura RSA com SHA-1 896/L5";
"06 09 2B 24 03 03 01 01 88 00 05"	= "Assinatura RSA com SHA-1 1024/L5";
"06 09 2B 24 03 03 01 01 84 00 09"	= "Assinatura RSA com SHA-1 512/L9";
"06 09 2B 24 03 03 01 01 85 00 09"	= "Assinatura RSA com SHA-1 640/L9";
"06 09 2B 24 03 03 01 01 86 00 09"	= "Assinatura RSA com SHA-1 768/L9";
"06 09 2B 24 03 03 01 01 87 00 09"	= "Assinatura RSA com SHA-1 896/L9";
"06 09 2B 24 03 03 01 01 88 00 09"	= "Assinatura RSA com SHA-1 1024/L9";
"06 09 2B 24 03 03 01 01 84 00 11"	= "Assinatura RSA com SHA-1 512/L11";
"06 09 2B 24 03 03 01 01 85 00 11"	= "Assinatura RSA com SHA-1 640/L11";
"06 09 2B 24 03 03 01 01 86 00 11"	= "Assinatura RSA com SHA-1 768/L11";
"06 09 2B 24 03 03 01 01 87 00 11"	= "Assinatura RSA com SHA-1 896/L11";
"06 09 2B 24 03 03 01 01 88 00 11"	= "Assinatura RSA com SHA-1 1024/L11";

"06 06 2B 24 03 03 01 02"			= "Assinatura RSA com RIPEMD-160";
"06 09 2B 24 03 03 01 02 84 00 02"	= "Assinatura RSA com RIPEMD-160 512/L2";
"06 09 2B 24 03 03 01 02 85 00 02"	= "Assinatura RSA com RIPEMD-160 640/L2";
"06 09 2B 24 03 03 01 02 86 00 02"	= "Assinatura RSA com RIPEMD-160 768/L2";
"06 09 2B 24 03 03 01 02 87 00 02"	= "Assinatura RSA com RIPEMD-160 896/L2";
"06 09 2B 24 03 03 01 02 88 00 02"	= "Assinatura RSA com RIPEMD-160 1024/L2";
"06 09 2B 24 03 03 01 02 84 00 03"	= "Assinatura RSA com RIPEMD-160 512/L3";
"06 09 2B 24 03 03 01 02 85 00 03"	= "Assinatura RSA com RIPEMD-160 640/L3";
"06 09 2B 24 03 03 01 02 86 00 03"	= "Assinatura RSA com RIPEMD-160 768/L3";
"06 09 2B 24 03 03 01 02 87 00 03"	= "Assinatura RSA com RIPEMD-160 896/L3";
"06 09 2B 24 03 03 01 02 88 00 03"	= "Assinatura RSA com RIPEMD-160 1024/L3";
"06 09 2B 24 03 03 01 02 84 00 05"	= "Assinatura RSA com RIPEMD-160 512/L5";
"06 09 2B 24 03 03 01 02 85 00 05"	= "Assinatura RSA com RIPEMD-160 640/L5";
"06 09 2B 24 03 03 01 02 86 00 05"	= "Assinatura RSA com RIPEMD-160 768/L5";
"06 09 2B 24 03 03 01 02 87 00 05"	= "RSA Signature with RIPEMD-160 896/L5";
"06 09 2B 24 03 03 01 02 88 00 05"	= "Assinatura RSA com RIPEMD-160 1024/L5";
"06 09 2B 24 03 03 01 02 84 00 09"	= "Assinatura RSA com RIPEMD-160 512/L9";
"06 09 2B 24 03 03 01 02 85 00 09"	= "Assinatura RSA com RIPEMD-160 640/L9";
"06 09 2B 24 03 03 01 02 86 00 09"	= "Assinatura RSA com RIPEMD-160 768/L9";
"06 09 2B 24 03 03 01 02 87 00 09"	= "Assinatura RSA com RIPEMD-160 896/L9";
"06 09 2B 24 03 03 01 02 88 00 09"	= "Assinatura RSA com RIPEMD-160 1024/L9";
"06 09 2B 24 03 03 01 02 84 00 11"	= "Assinatura RSA com RIPEMD-160 512/L11";
"06 09 2B 24 03 03 01 02 85 00 11"	= "Assinatura RSA com RIPEMD-160 640/L11";
"06 09 2B 24 03 03 01 02 86 00 11"	= "Assinatura RSA com RIPEMD-160 768/L11";
"06 09 2B 24 03 03 01 02 87 00 11"	= "Assinatura RSA com RIPEMD-160 896/L11";
"06 09 2B 24 03 03 01 02 88 00 11"	= "Assinatura RSA com RIPEMD-160 1024/L11";

"06 06 2B 24 03 03 01 03"			= "Assinatura RSA com RIPEMD-128";
"06 06 2B 24 03 03 01 04"			= "Assinatura RSA com RIPEMD-256";

"06 05 2B 24 03 03 02"				= "Assinatura ECSIE";
"06 06 2B 24 03 03 02 01"			= "Assinatura ECSIE com SHA-1";
"06 06 2B 24 03 03 02 02"			= "Assinatura ECSIE com RIPEMD-160";
"06 06 2B 24 03 03 02 03"			= "Assinatura ECSIE com MD2";
"06 06 2B 24 03 03 02 04"			= "Assinatura ECSIE com MD5";

"06 04 2B 24 03 04"					= "Esquema de Assinatura";
"06 05 2B 24 03 04 01"				= "ISO9796-1";
"06 05 2B 24 03 04 02"				= "ISO9796-2";
"06 05 2B 24 03 04 02 01"			= "ISO9796-2 com RED";
"06 06 2B 24 03 04 02 02"			= "ISO9796-2 com RSA";
"06 06 2B 24 03 04 02 03"			= "ISO9796-2 com RND";

"06 03 2B 24 04"					= "Atributo";
"06 03 2B 24 05"					= "Política";
"06 03 2B 24 06"					= "API";
"06 04 2B 24 06 01"					= "API Específica do Fabricante";
"06 05 2B 24 06 01 01"				= "UTIMACO-API";
"06 04 2B 24 06 02"					= "API Específica de Funcionalidade";
"06 03 2B 24 07"					= "Gerenciamento de Chave";
"06 04 2B 24 07 01"					= "Acordo de Chave";
"06 05 2B 24 07 01 01"				= "BSI PKE";
"06 04 2B 24 07 02"					= "Transferência de Chave";
"06 05 2B 24 07 02 01"				= "ISO9796-2 com Criptografia RSA";

"06 05 2B 24 08 01 01"				= "Identificador de Política SigiSigConform Teletrust";
"06 05 2B 24 08 02 01"				= "Serviço de Diretório";

"06 05 2B 24 08 03 01"				= "Data de Geração do Certificado";
"06 05 2B 24 08 03 02"				= "Procuração";
"06 05 2B 24 08 03 03"				= "Admissão";
"06 05 2B 24 08 03 04"				= "Limite Monetário";
"06 05 2B 24 08 03 05"				= "Declaração de Maioridade";
"06 05 2B 24 08 03 06"				= "Número de Série do Cartão de Circuito Integrado";
"06 05 2B 24 08 03 07"				= "Referência de Chave Pública";
"06 05 2B 24 08 03 08"				= "Restrição";
"06 05 2B 24 08 03 09"				= "Obter Se Permitido";
"06 05 2B 24 08 03 0A"				= "Certificado Solicitado";
"06 05 2B 24 08 03 0B"				= "Autoridades de Nomeação";
"06 05 2B 24 08 03 0C"				= "Certificado no Diretório Desde";
"06 05 2B 24 08 03 0D"				= "Criptografia de Certificado";

"06 05 2B 24 08 04 01"				= "Dados Pessoais";
"06 05 2B 24 08 04 08"				= "Restrição";
"06 07 2B 24 08 05 01 01 01"		= "RSA Indica SHA-1";
"06 07 2B 24 08 05 01 01 02"		= "RSA Indica RIPEMD-160";
"06 07 2B 24 08 05 01 01 03"		= "RSA com SHA-1";
"06 07 2B 24 08 05 01 01 04"		= "RSA com RIPEMD-160";
"06 07 2B 24 08 05 01 02 01"		= "DSA Ampliado";
"06 07 2B 24 08 05 01 02 02"		= "DSA com RIPEMD-160";

"06 05 2B 24 08 06 01"				= "Certificado";
"06 05 2B 24 08 06 02"				= "Referência do Certificado";
"06 05 2B 24 08 06 03"				= "Certificado de Atributo";
"06 05 2B 24 08 06 04"				= "Referência de Atributo";
"06 05 2B 24 08 06 05"				= "Nome do Arquivo";
"06 05 2B 24 08 06 06"				= "Tempo de Armazenamento";
"06 05 2B 24 08 06 07"				= "Tamanho do Arquivo";
"06 05 2B 24 08 06 08"				= "Localização";
"06 05 2B 24 08 06 09"				= "Número da Assinatura";
"06 05 2B 24 08 06 0A"				= "Gerado automaticamente";

"06 05 2B 24 08 07 01"				= "Tipos de Apresentação Teletrust";
"06 06 2B 24 08 07 01 01"			= "Adobe Illustrator";
"06 06 2B 24 08 07 01 02"			= "AmiPro";
"06 06 2B 24 08 07 01 03"			= "AutoCAD";
"06 06 2B 24 08 07 01 04"			= "Binário";
"06 06 2B 24 08 07 01 05"			= "BMP";
"06 06 2B 24 08 07 01 06"			= "CGM";
"06 06 2B 24 08 07 01 07"			= "CorelCRT";
"06 06 2B 24 08 07 01 08"			= "CorelDRW";
"06 06 2B 24 08 07 01 09"			= "CorelEXC";
"06 06 2B 24 08 07 01 0A"			= "CorelPHT";
"06 06 2B 24 08 07 01 0B"			= "Draw";
"06 06 2B 24 08 07 01 0C"			= "DVI";
"06 06 2B 24 08 07 01 0D"			= "EPS";
"06 06 2B 24 08 07 01 0E"			= "Excel";
"06 06 2B 24 08 07 01 0F"			= "GEM";
"06 06 2B 24 08 07 01 10"			= "GIF";
"06 06 2B 24 08 07 01 11"			= "HPGL";
"06 06 2B 24 08 07 01 12"			= "JPEG";
"06 06 2B 24 08 07 01 13"			= "Kodak";
"06 06 2B 24 08 07 01 14"			= "LaTeX";
"06 06 2B 24 08 07 01 15"			= "Lotus";
"06 06 2B 24 08 07 01 16"			= "LotusPIC";
"06 06 2B 24 08 07 01 17"			= "MacPICT";
"06 06 2B 24 08 07 01 18"			= "MacWord";
"06 06 2B 24 08 07 01 19"			= "MSWfD";
"06 06 2B 24 08 07 01 1A"			= "MSWord";
"06 06 2B 24 08 07 01 1B"			= "MSWord2";
"06 06 2B 24 08 07 01 1C"			= "MSWord6";
"06 06 2B 24 08 07 01 1D"			= "MSWord8";
"06 06 2B 24 08 07 01 1E"			= "PDF";
"06 06 2B 24 08 07 01 1F"			= "PIF";
"06 06 2B 24 08 07 01 20"			= "Postscript";
"06 06 2B 24 08 07 01 21"			= "RTF";
"06 06 2B 24 08 07 01 22"			= "SCITEX";
"06 06 2B 24 08 07 01 23"			= "TAR";
"06 06 2B 24 08 07 01 24"			= "Targa";
"06 06 2B 24 08 07 01 25"			= "TeX";
"06 06 2B 24 08 07 01 26"			= "Texto";
"06 06 2B 24 08 07 01 27"			= "TIFF";
"06 06 2B 24 08 07 01 28"			= "TIFF-FC";
"06 06 2B 24 08 07 01 29"			= "UID";
"06 06 2B 24 08 07 01 2A"			= "UUEncode";
"06 06 2B 24 08 07 01 2B"			= "WMF";
"06 06 2B 24 08 07 01 2C"			= "WordPerfect";
"06 06 2B 24 08 07 01 2D"			= "WPGrph";

/* Thawte */

"06 04 2B 65 01 04"					= "Ampliação de Certificado Thawte";
"06 05 2B 65 01 04 01"				= "Extranet Convincente";

/* X.520 */

"06 02 55 04"		= "Tipos de Atributo X.520";
"06 03 55 04 00"	= "Classe de Objeto";
"06 03 55 04 01"	= "Nome de Entrada com Atalho";
"06 03 55 04 02"	= "Informação de Conhecimento";
"06 03 55 04 03"	= "Nome Comum";
"06 03 55 04 04"	= "Sobrenome";
"06 03 55 04 05"	= "Número de Série";
"06 03 55 04 06"	= "País";
"06 03 55 04 07"	= "Localidade";
"06 04 55 04 07 01"	= "Nome Coletivo de Localidade";
"06 03 55 04 08"	= "Estado ou Província";
"06 04 55 04 08 01"	= "Nome Coletivo do Estado ou Província";
"06 03 55 04 09"	= "Endereço";
"06 04 55 04 09 01"	= "Endereço Coletivo";
"06 03 55 04 0A"	= "Empresa";
"06 04 55 04 0A 01"	= "Nome Coletivo da Empresa";
"06 03 55 04 0B"	= "Unidade Administrativa";
"06 04 55 04 0B 01"	= "Nome Coletivo da Unidade Empresarial";
"06 03 55 04 0C"	= "Título";
"06 03 55 04 0D"	= "Descrição";
"06 03 55 04 0E"	= "Guia de Busca";
"06 03 55 04 0F"	= "Categoria de Empresa";
"06 03 55 04 10"	= "Endereço Postal";
"06 04 55 04 10 01"	= "Endereço Postal Coletivo";
"06 03 55 04 11"	= "Código Postal";
"06 04 55 04 11 01"	= "Código Postal Coletivo";
"06 03 55 04 12"	= "Caixa Postal";
"06 04 55 04 12 01"	= "Caixa Postal Coletiva";
"06 03 55 04 13"	= "Escritório para Entrega Física";
"06 04 55 04 13 01"	= "Nome Coletivo do Escritório para Entrega Física";
"06 03 55 04 14"	= "Número de Telefone";
"06 04 55 04 14 01"	= "Número de Telefone Coletivo";
"06 03 55 04 15"	= "Número de Telex";
"06 04 55 04 15 01"	= "Número de Telex Coletivo";
"06 03 55 04 16"	= "Identificador de Terminal de Teletexto";
"06 04 55 04 16 01"	= "Identificador Coletivo de Terminal de Teletexto";
"06 03 55 04 17"	= "Número de Telefax";
"06 04 55 04 17 01"	= "Número de Telefax Coletivo";
"06 03 55 04 18"	= "Endereço X.121";
"06 03 55 04 19"	= "Número de ISDN Internacional";
"06 04 55 04 19 01"	= "Número Coletivo do ISDN Internacional";
"06 03 55 04 1A"	= "Endereço Registrado";
"06 03 55 04 1B"	= "Indicador de Destino";
"06 03 55 04 1C"	= "Método de Entrega Preferido";
"06 03 55 04 1D"	= "Endereço de Apresentação";
"06 03 55 04 1E"	= "Contexto de Aplicativo Compatível";
"06 03 55 04 1F"	= "Membro";
"06 03 55 04 20"	= "Proprietário";
"06 03 55 04 21"	= "Ocupante do Cargo";
"06 03 55 04 22"	= "Veja Também";
"06 03 55 04 23"	= "Senha de Usuário";
"06 03 55 04 24"	= "Certificado de Usuário";
"06 03 55 04 25"	= "Certificado CA";
"06 03 55 04 26"	= "Lista de Revogação de Autoridades";
"06 03 55 04 27"	= "Lista de Revogação de Certificados";
"06 03 55 04 28"	= "Emparelhamento de Certificado Cruzado";
"06 03 55 04 29"	= "Nome";
"06 03 55 04 2A"	= "Nome";
"06 03 55 04 2B"	= "Iniciais";
"06 03 55 04 2C"	= "Qualificador de Geração";
"06 03 55 04 2D"	= "Identificador Exclusivo";
"06 03 55 04 2E"	= "Qualificador de DN";
"06 03 55 04 2F"	= "Guia de Busca Aprimorado";
"06 03 55 04 30"	= "Informação de Protocolo";
"06 03 55 04 31"	= "Nome Exclusivo";
"06 03 55 04 32"	= "Membro Exclusivo";
"06 03 55 04 33"	= "Identificador de Casa";
"06 03 55 04 34"	= "Algoritmos Compatíveis";
"06 03 55 04 35"	= "Lista de Revogação Delta";
"06 03 55 04 36"	= "Permissão";
"06 03 55 04 3A"	= "Emparelhamento de Certificado Cruzado";

/* X.500 object classes */

"06 02 55 06"		= "Classe de Objeto X.520";
"06 03 55 06 00"	= "Superior";
"06 03 55 06 01"	= "Atalho";
"06 03 55 06 02"	= "País";
"06 03 55 06 03"	= "Localidade";
"06 03 55 06 04"	= "Empresa";
"06 03 55 06 05"	= "Unidade Administrativa";
"06 03 55 06 06"	= "Pessoa";
"06 03 55 06 07"	= "Pessoa Administrativa";
"06 03 55 06 08"	= "Cargo Administrativo";
"06 03 55 06 09"	= "Grupo de Nomes";
"06 03 55 06 0A"	= "Pessoa Residente";
"06 03 55 06 0B"	= "Processo de Aplicativo";
"06 03 55 06 0C"	= "Entidade de Aplicativo";
"06 03 55 06 0D"	= "DSA";
"06 03 55 06 0E"	= "Dispositivo";
"06 03 55 06 0F"	= "Usuário de Autenticação Convincente";
"06 03 55 06 10"	= "Autoridade de Certificação";
"06 03 55 06 11"	= "Grupo de Nomes Exclusivos";
"06 03 55 06 15"	= "Usuário PKI";
"06 03 55 06 16"	= "PKI CA";

/* X.500 algorithms */

"06 02 55 08"		= "Algoritmos X.500";
"06 03 55 08 01"	= "Algoritmos de Criptografia X.500";
"06 04 55 08 01 01"	= "RSA";

/* X.509 */

"06 02 55 1D"		= "Ampliações de Certificado X.509";
"06 03 55 1D 01"	= "Identificador de Chave de Autoridade (antigo)";
"06 03 55 1D 02"	= "Atributos de Chave Primários (antigos)";
"06 03 55 1D 03"	= "Políticas de Certificado (antigas)";
"06 03 55 1D 04"	= "Restrição de Uso de Chave (antiga)";
"06 03 55 1D 05"	= "Mapeamento de Política (antigo)";
"06 03 55 1D 06"	= "Restrição de Subárvores";
"06 03 55 1D 07"	= "Nome Alternativo de Sujeito (antigo)";
"06 03 55 1D 08"	= "Nome Alternativo do Emissor (antigo)";
"06 03 55 1D 09"	= "Atributos de Diretório de Sujeitos";
"06 03 55 1D 0A"	= "Restrições Básicas (antigo 2.5.29.10)";
"06 03 55 1D 0B"	= "Restrições de Nomes (antigas)";
"06 03 55 1D 0C"	= "Restrições de Política (antigas)";
"06 03 55 1D 0D"	= "Restrições Básicas (antigo 2.5.29.13)";
"06 03 55 1D 0E"	= "Identificador de Chave do Sujeito";
"06 03 55 1D 0F"	= "Uso da Chave";
"06 03 55 1D 10"	= "Período de Uso de Chave Privada";
"06 03 55 1D 11"	= "Nome Alternativo de Sujeito";
"06 03 55 1D 12"	= "Nome Alternativo do Emissor";
"06 03 55 1D 13"	= "Restrições Básicas";
"06 03 55 1D 14"	= "Número da Lista de Revogação de Certificados";
"06 03 55 1D 15"	= "Código de Razão da CRL";
"06 03 55 1D 16"	= "Data de Expiração (antiga)";
"06 03 55 1D 17"	= "Código de Instrução de Suspensão";
"06 03 55 1D 18"	= "Data de Invalidade";
"06 03 55 1D 19"	= "Pontos de Distribuição da CRL (antigos)";
"06 03 55 1D 1A"	= "Ponto de Distribuição da Emissão (antigo)";
"06 03 55 1D 1B"	= "Indicador Delta CRL";
"06 03 55 1D 1C"	= "Ponto de Distribuição da Emissão";
"06 03 55 1D 1D"	= "Emissor do Certificado";
"06 03 55 1D 1E"	= "Restrições de Nome";
"06 03 55 1D 1F"	= "Pontos de Distribuição da CRL";
"06 03 55 1D 20"	= "Políticas de Certificado";
"06 04 55 1D 20 00"	= "Qualquer Identificador de Política";
"06 03 55 1D 21"	= "Mapeamentos de Política";
"06 03 55 1D 22"	= "Restrições de Política";
"06 03 55 1D 23"	= "Identificador de Chave de Autoridade";
"06 03 55 1D 24"	= "Restrições de Política";
"06 03 55 1D 25"	= "Uso Ampliado de Chave";
"06 04 55 1D 25 00"	= "Any Extended Key Usage";

/* DMS - SDN.700 INFOSEC algorithms */

"06 09 60 86 48 01 65 02 01 01 01"	= "Algoritmo de Assinatura SDNS";
"06 09 60 86 48 01 65 02 01 01 02"	= "Algoritmo de Assinatura Fortezza";
"06 09 60 86 48 01 65 02 01 01 03"	= "Algoritmo de Confidencialidade SDNS";
"06 09 60 86 48 01 65 02 01 01 04"	= "Algoritmo de Confidencialidade Fortezza";
"06 09 60 86 48 01 65 02 01 01 05"	= "Algoritmo de Integridade SDNS";
"06 09 60 86 48 01 65 02 01 01 06"	= "Algoritmo de Integridade Fortezza";
"06 09 60 86 48 01 65 02 01 01 07"	= "Algoritmo de Proteção de Token SDNS";
"06 09 60 86 48 01 65 02 01 01 08"	= "Algoritmo de Proteção de Token Fortezza";
"06 09 60 86 48 01 65 02 01 01 09"	= "Algoritmo de Gerenciamento de Chave SDNS";
"06 09 60 86 48 01 65 02 01 01 0A"	= "Algoritmo de Gerenciamento de Chave Fortezza";
"06 09 60 86 48 01 65 02 01 01 0B"	= "Algoritmo de Assinatura e Gerenciamento de Chave SDNS";
"06 09 60 86 48 01 65 02 01 01 0C"	= "Algoritmo de Assinatura e Gerenciamento de Chave Fortezza";
"06 09 60 86 48 01 65 02 01 01 0D"	= "Algoritmo de Assinatura do Grupo A";
"06 09 60 86 48 01 65 02 01 01 0E"	= "Algoritmo de Confidencialidade do Grupo A";
"06 09 60 86 48 01 65 02 01 01 0F"	= "Algoritmo de Integridade do Grupo A";
"06 09 60 86 48 01 65 02 01 01 10"	= "Algoritmo de Proteção de Token do Grupo A";
"06 09 60 86 48 01 65 02 01 01 11"	= "Algoritmo de Gerenciamento de Chave do Grupo A";
"06 09 60 86 48 01 65 02 01 01 12"	= "Algoritmo de Assinatura e Gerenciamento de Chave do Grupo A";
"06 09 60 86 48 01 65 02 01 01 13"	= "Algoritmo de Assinatura Atualizado Fortezza";
"06 09 60 86 48 01 65 02 01 01 14"	= "Algoritmos de Assinatura Atualizados e Gerenciamento de Chave Fortezza";
"06 09 60 86 48 01 65 02 01 01 15"	= "Algoritmo de Integridade Atualizado Fortezza";
"06 09 60 86 48 01 65 02 01 01 16"	= "Algoritmo de Intercâmbio de Chave";
"06 09 60 86 48 01 65 02 01 01 17"	= "Algoritmo Fortezza Wrap80";
"06 09 60 86 48 01 65 02 01 01 18"	= "Algoritmo de Criptografia de Chave (KEA)";

"06 09 60 86 48 01 65 02 01 02 01"	= "Formato de Mensagem RFC 822";
"06 09 60 86 48 01 65 02 01 02 02"	= "Conteúdo Vazio";
"06 09 60 86 48 01 65 02 01 02 03"	= "Tipo de Conteúdo CSP";
"06 09 60 86 48 01 65 02 01 02 2A"	= "Tipo de Conteúdo TMSP Rev 3";
"06 09 60 86 48 01 65 02 01 02 30"	= "Tipo de Conteúdo MSP";
"06 09 60 86 48 01 65 02 01 02 31"	= "Protocolo de Agente MSP Rekey";
"06 09 60 86 48 01 65 02 01 02 32"	= "MSP MMP";
"06 09 60 86 48 01 65 02 01 02 42"	= "Tipo de Conteúdo MSP Rev 3.1";
"06 09 60 86 48 01 65 02 01 02 48"	= "Parte do Corpo da Mensagem MSP Emcaminhada";
"06 09 60 86 48 01 65 02 01 02 49"	= "Parâmetros de Mensagem Encaminhada MSP";
"06 09 60 86 48 01 65 02 01 02 50"	= "Parte do Corpo da Mensagem CSP Encaminhada";
"06 09 60 86 48 01 65 02 01 02 51"	= "Parâmetros de Mensagem Encaminhada CSP";
"06 09 60 86 48 01 65 02 01 02 52"	= "MSP MMP2";

/* SDN.700 INFOSEC policy */

"06 09 60 86 48 01 65 02 01 03 01"		= "Política de Segurança SDNS";
"06 09 60 86 48 01 65 02 01 03 02"		= "SDNS PRBAC";
"06 09 60 86 48 01 65 02 01 03 03"		= "PRBAC de Mosaico";

"06 09 60 86 48 01 65 02 01 03 0A"		= "Política de Segurança";
"06 0A 60 86 48 01 65 02 01 03 0A 00"	= "NASP";
"06 0A 60 86 48 01 65 02 01 03 0A 01"	= "ELCO";
"06 0A 60 86 48 01 65 02 01 03 0A 02"	= "TK";
"06 0A 60 86 48 01 65 02 01 03 0A 03"	= "DSAP";
"06 0A 60 86 48 01 65 02 01 03 0A 04"	= "SSSS";
"06 0A 60 86 48 01 65 02 01 03 0A 05"	= "DNASP";
"06 0A 60 86 48 01 65 02 01 03 0A 06"	= "BYEMAN";
"06 0A 60 86 48 01 65 02 01 03 0A 07"	= "REL-US";
"06 0A 60 86 48 01 65 02 01 03 0A 08"	= "REL-AUS";
"06 0A 60 86 48 01 65 02 01 03 0A 09"	= "REL-CAN";
"06 0A 60 86 48 01 65 02 01 03 0A 0A"	= "REL-UK";
"06 0A 60 86 48 01 65 02 01 03 0A 0B"	= "REL-NZ";
"06 0A 60 86 48 01 65 02 01 03 0A 0C"	= "Genérico";

"06 09 60 86 48 01 65 02 01 03 0B"			= "genser";
"06 0A 60 86 48 01 65 02 01 03 0B 00"		= "genserNations";
"06 0A 60 86 48 01 65 02 01 03 0B 01"		= "genserComsec";
"06 0A 60 86 48 01 65 02 01 03 0B 02"		= "genserAcquisition";
"06 0A 60 86 48 01 65 02 01 03 0B 03"		= "genserSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0B 03 00"	= "genserTagSetName";

"06 09 60 86 48 01 65 02 01 03 0C"			= "Política de Segurança Padrão";
"06 09 60 86 48 01 65 02 01 03 0D"			= "capcoMarkings";
"06 0A 60 86 48 01 65 02 01 03 0D 00"		= "capcoSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0D 00 01"	= "capcoTagSetName1";
"06 0B 60 86 48 01 65 02 01 03 0D 00 02"	= "capcoTagSetName2";
"06 0B 60 86 48 01 65 02 01 03 0D 00 03"	= "capcoTagSetName3";
"06 0B 60 86 48 01 65 02 01 03 0D 00 04"	= "capcoTagSetName4";

"06 09 60 86 48 01 65 02 01 05 01"	= "Certificado de Gerenciamento de Chave SDNS";
"06 09 60 86 48 01 65 02 01 05 02"	= "Certificado de Assinatura de Usuário SDNS";
"06 09 60 86 48 01 65 02 01 05 03"	= "Certificado de Assinatura e Gerenciamento de Chave SDNS";
"06 09 60 86 48 01 65 02 01 05 04"	= "Certificado de Gerenciamento de Chave Fortezza";
"06 09 60 86 48 01 65 02 01 05 05"	= "Certificado de Assinatura e Gerenciamento de Chave Fortezza";
"06 09 60 86 48 01 65 02 01 05 06"	= "Certificado de Assinatura de Usuário Fortezza";
"06 09 60 86 48 01 65 02 01 05 07"	= "Certificado de Assinatura de CA Fortezza";
"06 09 60 86 48 01 65 02 01 05 08"	= "Certificado de Assinatura de CA SDNS";
"06 09 60 86 48 01 65 02 01 05 0A"	= "Vetor Auxiliar";
"06 09 60 86 48 01 65 02 01 05 0B"	= "Política de Recibo";
"06 09 60 86 48 01 65 02 01 05 0C"	= "Filiação";
"06 09 60 86 48 01 65 02 01 05 0D"	= "Administradores";
"06 09 60 86 48 01 65 02 01 05 0E"	= "alid";
"06 09 60 86 48 01 65 02 01 05 14"	= "janUKMs";
"06 09 60 86 48 01 65 02 01 05 15"	= "fevUKMs";
"06 09 60 86 48 01 65 02 01 05 16"	= "marUKMs";
"06 09 60 86 48 01 65 02 01 05 17"	= "abrUKMs";
"06 09 60 86 48 01 65 02 01 05 18"	= "maiUKMs";
"06 09 60 86 48 01 65 02 01 05 19"	= "junUKMs";
"06 09 60 86 48 01 65 02 01 05 1A"	= "julUKMs";
"06 09 60 86 48 01 65 02 01 05 1B"	= "agoUKMs";
"06 09 60 86 48 01 65 02 01 05 1C"	= "setUKMs";
"06 09 60 86 48 01 65 02 01 05 1D"	= "outUKMs";
"06 09 60 86 48 01 65 02 01 05 1E"	= "novUKMs";
"06 09 60 86 48 01 65 02 01 05 1F"	= "dezUKMs";

"06 09 60 86 48 01 65 02 01 05 28"	= "Meta SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 29"	= "SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 2A"	= "CKL de Assinatura Meta SDNS";
"06 09 60 86 48 01 65 02 01 05 2B"	= "CKL de Assinatura SDNS";
"06 09 60 86 48 01 65 02 01 05 2C"	= "Lista de Revogação de Certificados SDNS";
"06 09 60 86 48 01 65 02 01 05 2D"	= "Lista de Revogação de Certificado Fortezza";
"06 09 60 86 48 01 65 02 01 05 2E"	= "Fortezza CKL";
"06 09 60 86 48 01 65 02 01 05 2F"	= "Processador de Endereço Isento";
"06 09 60 86 48 01 65 02 01 05 30"	= "Defesa";
"06 09 60 86 48 01 65 02 01 05 31"	= "Algoritmos Compatíveis";
"06 09 60 86 48 01 65 02 01 05 32"	= "Certificado de Gerenciamento de Chave do Grupo A";
"06 09 60 86 48 01 65 02 01 05 33"	= "Certificado de Assinatura e Gerenciamento de Chave do Grupo A";
"06 09 60 86 48 01 65 02 01 05 34"	= "Certificado de Assinatura de Usuário do Grupo A";
"06 09 60 86 48 01 65 02 01 05 35"	= "Informações de PRBAC";
"06 09 60 86 48 01 65 02 01 05 36"	= "Restrições da CA de PRBAC";
"06 09 60 86 48 01 65 02 01 05 37"	= "Privilégios de Gerenciamento de Chave ou Assinatura";
"06 09 60 86 48 01 65 02 01 05 38"	= "Privilégios de Comunicação";
"06 09 60 86 48 01 65 02 01 05 39"	= "Atributo Etiquetado";
"06 09 60 86 48 01 65 02 01 05 3A"	= "Arquivo de Informação de Política";
"06 09 60 86 48 01 65 02 01 05 3B"	= "Arquivo de Informação de Política de Seg.";
"06 09 60 86 48 01 65 02 01 05 3C"	= "Restrição de Permissão de CA";

"06 09 60 86 48 01 65 02 01 07 01"		= "Ampliações CSP";
"06 0A 60 86 48 01 65 02 01 07 01 00"	= "cspCsExtn";
"06 09 60 86 48 01 65 02 01 08 01"		= "Categorias de Segurança ISSI";
"06 09 60 86 48 01 65 02 01 08 02"		= "Privilégios de Etiqueta de Segurança Padrão";

"06 09 60 86 48 01 65 02 01 0A 01"			= "Privilégios de Assinatura";
"06 09 60 86 48 01 65 02 01 0A 02"			= "Privilégios do Gerenciamento de Chaves";
"06 09 60 86 48 01 65 02 01 0A 03"			= "Privilégio de Conjunto de Etiquetas Nomeadas";
"06 09 60 86 48 01 65 02 01 0B 01"			= "UK Demo";
"06 09 60 86 48 01 65 02 01 0B 02"			= "Classe 2 do Departamento de Defesa dos EUA";
"06 09 60 86 48 01 65 02 01 0B 03"			= "US Medium Pilot";
"06 09 60 86 48 01 65 02 01 0B 04"			= "Classe 4 do Departamento de Defesa dos EUA";
"06 09 60 86 48 01 65 02 01 0B 05"			= "Classe 3 do Departamento de Defesa dos EUA";
"06 09 60 86 48 01 65 02 01 0B 06"			= "Classe 5 do Departamento de Defesa dos EUA";
"06 09 60 86 48 01 65 02 01 0B 09"			= "PKI Classe 3 do Departamento de Defesa dos EUA";

"06 09 60 86 48 01 65 02 01 0C 00"			= "Política de Segurança de Teste";
"06 0A 60 86 48 01 65 02 01 0C 00 01"		= "TSP1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00"	= "TSP1 SecurityCategories";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 00"	= "Conjunto de Etiquetas TSP1 Zero";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 01"	= "Conjunto de Etiquetas TSP1 Um";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 02"	= "Conjunto de Etiquetas TSP1 Dois";
"06 0A 60 86 48 01 65 02 01 0C 00 02"		= "TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00"	= "Categorias de Segurança TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 00"	= "Conjunto de Etiquetas TSP2 Zero";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 01"	= "Conjunto de Etiquetas TSP2 Um";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 02"	= "Conjunto de Etiquetas TSP2 Dois";

"06 0A 60 86 48 01 65 02 01 0C 00 03"		= "Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00"	= "Categorias de Segurança Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 01"	= "Nome 1 do Conjunto de Etiquetas Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 02"	= "Nome 2 do Conjunto de Etiquetas Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 03"	= "Nome 3 do Conjunto de Etiquetas Kafka";

"06 0A 60 86 48 01 65 02 01 0C 01 01"		= "TCP1";
"06 09 60 86 48 01 65 02 01 0C 02"			= "Entrada de CRL de Teste";

/* CSOR GAK-FIPS */

"06 07 60 86 48 01 65 03 01"			= "Etiqueta";
"06 07 60 86 48 01 65 03 02"			= "PKI";
"06 08 60 86 48 01 65 03 02 01"			= "Identificador de Política GAK";
"06 0A 60 86 48 01 65 03 02 01 03 01"	= "Identificador de Política Rudimentar FBCA";
"06 0A 60 86 48 01 65 03 02 01 03 02"	= "Identificador de Política Básica FBCA";
"06 0A 60 86 48 01 65 03 02 01 03 03"	= "Identificador de Política Média FBCA";
"06 0A 60 86 48 01 65 03 02 01 03 04"	= "Identificador de Política Avançada FBCA";
"06 08 60 86 48 01 65 03 02 02"			= "GAK";
"06 09 60 86 48 01 65 03 02 02 01"		= "Chave KRA";
"06 08 60 86 48 01 65 03 02 03"			= "Ampliações";
"06 09 60 86 48 01 65 03 02 03 01"		= "Técnica de Recuperação de Chave";
"06 09 60 86 48 01 65 03 02 03 02"		= "Compatível com Recuperação de Chave";
"06 09 60 86 48 01 65 03 02 03 03"		= "Recuperação de Chave";
"06 08 60 86 48 01 65 03 02 04"			= "Esquemas de Recuperação de Chave";
"06 08 60 86 48 01 65 03 02 05"			= "Ampliação CSOR GAK";
"06 07 60 86 48 01 65 03 03"			= "ARPA";

/* CSOR (NIST) Algorithms */

"06 07 60 86 48 01 65 03 04"			= "Algoritmo NIST";
"06 08 60 86 48 01 65 03 04 01"			= "AES";
"06 09 60 86 48 01 65 03 04 01 01"		= "AES 128-ECB";
"06 09 60 86 48 01 65 03 04 01 02"		= "AES 128-CBC";
"06 09 60 86 48 01 65 03 04 01 03"		= "AES 128-OFB";
"06 09 60 86 48 01 65 03 04 01 04"		= "AES 128-CFB";
"06 09 60 86 48 01 65 03 04 01 15"		= "AES 192-ECB";
"06 09 60 86 48 01 65 03 04 01 16"		= "AES 192-CBC";
"06 09 60 86 48 01 65 03 04 01 17"		= "AES 192-OFB";
"06 09 60 86 48 01 65 03 04 01 18"		= "AES 192-CFB";
"06 09 60 86 48 01 65 03 04 01 29"		= "AES 256-ECB";
"06 09 60 86 48 01 65 03 04 01 2A"		= "AES 256-CBC";
"06 09 60 86 48 01 65 03 04 01 2B"		= "AES 256-OFB";
"06 09 60 86 48 01 65 03 04 01 2C"		= "AES 256-CFB";

/* NIST secure hash algorithms */

"06 08 60 86 48 01 65 03 04 02"         = "SHA";
"06 09 60 86 48 01 65 03 04 02 01"      = "SHA-256";
"06 09 60 86 48 01 65 03 04 02 02"      = "SHA-384";
"06 09 60 86 48 01 65 03 04 02 03"      = "SHA-512";
"06 09 60 86 48 01 65 03 04 02 04"      = "SHA-224";

/* Novell */

"06 0A 60 86 48 01 86 F8 37 01 02 08"		= "Algoritmo Novell";
"06 0B 60 86 48 01 86 F8 37 01 02 08 16"	= "DES-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 17"	= "DES-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 18"	= "DES-EDE2-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 19"	= "DES-EDE2-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1A"	= "DES-EDE3-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1B"	= "DES-EDE3-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1C"	= "Pad RC5-CBC";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1D"	= "MD2 com Criptografia RSA BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1E"	= "MD5 com Criptografia RSA BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1F"	= "SHA-1 com Criptografia RSA BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 20"	= "Compilação LM";
"06 0B 60 86 48 01 86 F8 37 01 02 08 28"	= "MD2";
"06 0B 60 86 48 01 86 F8 37 01 02 08 32"	= "MD5";
"06 0B 60 86 48 01 86 F8 37 01 02 08 33"	= "IKE HMAC com SHA1-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 34"	= "IKE HMAC com MD5-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 45"	= "Pad RC2-CBC";
"06 0B 60 86 48 01 86 F8 37 01 02 08 52"	= "SHA-1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5C"	= "RC2-CBC BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5F"	= "MD4";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 02"	= "Pacote MD4";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 03"	= "Criptografia RSA BSAFE1";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 04"	= "Senha NW";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 05"	= "Novell Obfuscate-1";

"06 09 60 86 48 01 86 F8 37 01 09"			= "PKI";
"06 0A 60 86 48 01 86 F8 37 01 09 04"		= "Tipo de Atributo PKI";
"06 0B 60 86 48 01 86 F8 37 01 09 04 01"	= "Atributos de Segurança";
"06 0B 60 86 48 01 86 F8 37 01 09 04 02"	= "Limite de Confiança";

/* Netscape */

"06 07 60 86 48 01 86 F8 42"		= "Identificador de Objetos do Netscape";
"06 08 60 86 48 01 86 F8 42 01"		= "Ampliação de Certificado do Netscape";
"06 09 60 86 48 01 86 F8 42 01 01"	= "Tipo de Certificado do Netscape";
"06 09 60 86 48 01 86 F8 42 01 02"	= "URL Base do Netscape";
"06 09 60 86 48 01 86 F8 42 01 03"	= "URL de Revogação do Netscape";
"06 09 60 86 48 01 86 F8 42 01 04"	= "URL de Revogação da CA do Netscape";
"06 09 60 86 48 01 86 F8 42 01 05"	= "URL de Transferência de CRL do Netscape";
"06 09 60 86 48 01 86 F8 42 01 06"	= "URL de Transferência de Certificados da CA do Netscape";
"06 09 60 86 48 01 86 F8 42 01 07"	= "URL de Renovação de Certificado do Netscape";
"06 09 60 86 48 01 86 F8 42 01 08"	= "URL da Política de CA do Netscape";
"06 09 60 86 48 01 86 F8 42 01 09"	= "URL da Página Inicial de Certificados do Netscape";
"06 09 60 86 48 01 86 F8 42 01 0A"	= "Logotipo de Entidade de Certificado do Netscape";
"06 09 60 86 48 01 86 F8 42 01 0B"	= "Foto de Usuário do Certificado do Netscape";
"06 09 60 86 48 01 86 F8 42 01 0C"	= "Servidor SSL do Netscape";
"06 09 60 86 48 01 86 F8 42 01 0D"	= "Comentário de Certificado do Netscape";

"06 08 60 86 48 01 86 F8 42 02"		= "Tipo de Dados do Netscape";
"06 09 60 86 48 01 86 F8 42 02 01"	= "imagem/GIF";
"06 09 60 86 48 01 86 F8 42 02 02"	= "imagem/JPEG";
"06 09 60 86 48 01 86 F8 42 02 03"	= "URL";
"06 09 60 86 48 01 86 F8 42 02 04"	= "texto/HTML";

"06 09 60 86 48 01 86 F8 42 02 05"	= "Sequência de Certificado do Netscape";
"06 09 60 86 48 01 86 F8 42 02 06"	= "URL de Certificado do Netscape";

"06 08 60 86 48 01 86 F8 42 03"			= "Identificador de Objetos do Diretório do Netscape";
"06 09 60 86 48 01 86 F8 42 03 01"		= "Definições LDAP";
"06 0A 60 86 48 01 86 F8 42 03 01 01"	= "Licença de Automóvel";
"06 0A 60 86 48 01 86 F8 42 03 01 02"	= "Número do Departamento";
"06 0A 60 86 48 01 86 F8 42 03 01 03"	= "Número de Funcionário";
"06 0A 60 86 48 01 86 F8 42 03 01 04"	= "Tipo de Funcionário";
"06 0A 60 86 48 01 86 F8 42 03 02 02"	= "Pessoa Administradora da Intranet";

"06 09 60 86 48 01 86 F8 42 04 01"		= "Criptografia com Porta de Servidor";

/* Verisign */

/* Country, zip, date of birth (age), and gender of cert owner (CZAG) in obfuscated form */
"06 0A 60 86 48 01 86 F8 45 01 06 03"	= "Verisign CZAG";

/* Text string used in certs issued to Netscape InBox customers */
"06 0A 60 86 48 01 86 F8 45 01 06 06"	= "Caixa de Entrada Verisign";

"06 0A 60 86 48 01 86 F8 45 01 06 0B"	= "Ampliação Verisign VPN Desconhecida";
"06 0A 60 86 48 01 86 F8 45 01 06 0D"	= "Ampliação Verisign VPN Desconhecida";

"06 0B 60 86 48 01 86 F8 45 01 07 01 01"	= "Identificador de Política Verisign";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 01"	= "Aviso de Verisign CPS v1";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 02"	= "Verisign CPS v1 NSI";

"06 0A 60 86 48 01 86 F8 45 01 08 01"		= "CA Verisign SGC";

/* SET */

"06 03 67 2A 00"	= "Tipo de Conteúdo";
"06 04 67 2A 00 00"	= "Dados PAN";
"06 04 67 2A 00 01"	= "Token PAN";
"06 04 67 2A 00 02"	= "Somente PAN";

"06 03 67 2A 01"	= "Ampliação de Mensagem";
"06 03 67 2A 02"	= "Campo";
"06 04 67 2A 02 00"	= "Nome Completo";
"06 04 67 2A 02 01"	= "Nome";
"06 04 67 2A 02 02"	= "Sobrenome";
"06 04 67 2A 02 03"	= "Sobrenome de Nascimento";
"06 04 67 2A 02 04"	= "Lugar";
"06 04 67 2A 02 05"	= "Número de Identificação";
"06 04 67 2A 02 06"	= "Mês";
"06 04 67 2A 02 07"	= "Data";
"06 04 67 2A 02 08"	= "Endereço";
"06 04 67 2A 02 09"	= "Telefone";
"06 04 67 2A 02 0A"	= "Quantidade";
"06 04 67 2A 02 0B"	= "Número de Conta";
"06 04 67 2A 02 0C"	= "Frase-senha";

"06 03 67 2A 03"		= "Atributo";
"06 04 67 2A 03 00"		= "Certificado";
"06 05 67 2A 03 00 00"	= "Impressão Digital da Chave Raiz";
"06 05 67 2A 03 00 01"	= "Política Adicional";

"06 03 67 2A 04"	= "Algoritmo";
"06 03 67 2A 05"	= "Política";
"06 04 67 2A 05 00"	= "Raiz";
"06 03 67 2A 06"	= "Módulo";
"06 03 67 2A 07"	= "Ampliação de Certificado";
"06 04 67 2A 07 00"	= "Chave Raiz Criptografada";
"06 04 67 2A 07 01"	= "Tipo de Certificado";
"06 04 67 2A 07 02"	= "Dados Mercantis";
"06 04 67 2A 07 03"	= "Cert. de Cartão Exigido";
"06 04 67 2A 07 04"	= "Encapsulamento";
"06 04 67 2A 07 05"	= "Ampliações SET";
"06 04 67 2A 07 06"	= "Qualificador SET";

"06 03 67 2A 08"	= "Marca";
"06 04 67 2A 08 01"		= "IATA-ATA";
"06 04 67 2A 08 04"		= "VISA";
"06 04 67 2A 08 05"		= "MasterCard";
"06 04 67 2A 08 1E"		= "Diners";
"06 04 67 2A 08 22"		= "American Express";
"06 05 67 2A 08 AE 7B"	= "Novus";

"06 03 67 2A 09"	= "Fornecedor";
"06 04 67 2A 09 00"	= "GlobeSet";
"06 04 67 2A 09 01"	= "IBM";
"06 04 67 2A 09 02"	= "CyberCash";
"06 04 67 2A 09 03"	= "Terisa";
"06 04 67 2A 09 04"	= "RSADSI";
"06 04 67 2A 09 05"	= "VeriFone";
"06 04 67 2A 09 06"	= "TrinTech";
"06 04 67 2A 09 07"	= "BankGate";
"06 04 67 2A 09 08"	= "GTE";
"06 04 67 2A 09 09"	= "CompuSource";
"06 04 67 2A 09 0A"	= "Griffin";
"06 04 67 2A 09 0B"	= "Certicom";
"06 04 67 2A 09 0C"	= "OSS";
"06 04 67 2A 09 0D"	= "TenthMountain";
"06 04 67 2A 09 0E"	= "Antares";
"06 04 67 2A 09 0F"	= "ECC";
"06 04 67 2A 09 10"	= "Maithean";
"06 04 67 2A 09 11"	= "Netscape";
"06 04 67 2A 09 12"	= "Verisign";
"06 04 67 2A 09 13"	= "BlueMoney";
"06 04 67 2A 09 14"	= "Lacerte";
"06 04 67 2A 09 15"	= "Fujitsu";
"06 04 67 2A 09 16"	= "eLab";
"06 04 67 2A 09 17"	= "Confiar";
"06 04 67 2A 09 18"	= "VIAnet";
"06 04 67 2A 09 19"	= "III";
"06 04 67 2A 09 1A"	= "OpenMarket";
"06 04 67 2A 09 1B"	= "Lexem";
"06 04 67 2A 09 1C"	= "Intertrader";
"06 04 67 2A 09 1D"	= "Caqui";
"06 04 67 2A 09 1E"	= "NABLE";
"06 04 67 2A 09 1F"	= "espace-net";
"06 04 67 2A 09 20"	= "Hitachi";
"06 04 67 2A 09 21"	= "Microsoft";
"06 04 67 2A 09 22"	= "NEC";
"06 04 67 2A 09 23"	= "Mitsubishi";
"06 04 67 2A 09 24"	= "NCR";
"06 04 67 2A 09 25"	= "e-COMM";
"06 04 67 2A 09 26"	= "Gemplus";

"06 03 67 2A 0A"	= "Nacional";
"06 05 67 2A 0A E2 00"	= "Japão";

/* Draft SET (deprecated) */

"06 04 86 8D 6F 02"	= "Chave Raiz Criptografada";
"06 04 86 8D 6F 03"	= "Tipo de Certificado";
"06 04 86 8D 6F 04"	= "Dados Mercantis";
"06 04 86 8D 6F 05"	= "Certificado de Cartão Requerido";
"06 04 86 8D 6F 06"	= "Encapsulamento";
"06 04 86 8D 6F 07"	= "Qualificador SET";
"06 04 86 8D 6F 63"	= "Dados SET";

/* Apple */

"06 06 2A 86 48 86 F7 63"		= "Apple";
"06 07 2A 86 48 86 F7 63 64"	= "Segurança de Dados da Apple";

"06 08 2A 86 48 86 F7 63 64 01" = "Identificador de Política de Confiabilidade da Apple";
"06 09 2A 86 48 86 F7 63 64 01 01"  = "Política Apple iSign";
"06 09 2A 86 48 86 F7 63 64 01 02"  = "Política Básica X.509 da Apple";
"06 09 2A 86 48 86 F7 63 64 01 03"  = "Política de SSL da Apple";
"06 09 2A 86 48 86 F7 63 64 01 04"  = "Política de Geração de Certificado Local da Apple";
"06 09 2A 86 48 86 F7 63 64 01 05"  = "Política de Geração de CSR Local da Apple";
"06 09 2A 86 48 86 F7 63 64 01 06"  = "Política de Revogação de CRL da Apple";
"06 09 2A 86 48 86 F7 63 64 01 07"  = "Política de Revogação de OCSP da Apple";
"06 09 2A 86 48 86 F7 63 64 01 08"  = "Política de S/MIME da Apple";
"06 09 2A 86 48 86 F7 63 64 01 09"  = "Política de Autenticação Ampliável da Apple";
"06 09 2A 86 48 86 F7 63 64 01 0A"  = "Política de Autenticação de Atualização de Software da Apple";
"06 09 2A 86 48 86 F7 63 64 01 0B"  = "Política de IPsec da Apple";
"06 09 2A 86 48 86 F7 63 64 01 0C"  = "Política do iChat da Apple";
"06 09 2A 86 48 86 F7 63 64 01 0D"  = "Política de Autenticação de Recurso da Apple";
"06 09 2A 86 48 86 F7 63 64 01 0E"  = "Política de Cliente Kerberos da Apple";
"06 09 2A 86 48 86 F7 63 64 01 0F"  = "Política de Servidor Kerberos da Apple";
"06 09 2A 86 48 86 F7 63 64 01 10"  = "Política de Assinatura de Código da Apple";
"06 09 2A 86 48 86 F7 63 64 01 11"  = "Política de Autenticação de Pacote da Apple";

"06 08 2A 86 48 86 F7 63 64 02" = "Identificador de Algoritmo de Segurança da Apple";
"06 09 2A 86 48 86 F7 63 64 02 01"  = "Criptografia Elíptica Rápida (FEE)";
"06 09 2A 86 48 86 F7 63 64 02 02"  = "Compressão Segura da Apple (ASC)";
"06 09 2A 86 48 86 F7 63 64 02 03"  = "FEE com Assinatura MD5";
"06 09 2A 86 48 86 F7 63 64 02 04"  = "FEE com Assinatura SHA-1";
"06 09 2A 86 48 86 F7 63 64 02 05"  = "Criptografia FEED da Apple";
"06 09 2A 86 48 86 F7 63 64 02 06"  = "Apple FEED (Experimental)";
"06 09 2A 86 48 86 F7 63 64 02 07"  = "FEE com Assinatura ECDSA";

"06 08 2A 86 48 86 F7 63 64 03" = "Identificador de Certificado .Mac da Apple";
"06 09 2A 86 48 86 F7 63 64 03 01"  = "Pedido de Certificado .Mac da Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 01"  = "Pedido de Cert. de Identidade .Mac da Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 02"  = "Pedido de Cert. de Assinatura de E-mail .Mac da Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 03"  = "Pedido de Cert. de Criptografia de E-mail .Mac da Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 04"  = "Pedido de Lista de Arquivos .Mac da Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 05"  = "Pedido de Armaz. de Arquivo .Mac da Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 06"  = "Pedido de Obtenção de Arquivo .Mac da Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 07"  = "Pedido de Remoção de Arquivo .Mac da Apple";
"06 09 2A 86 48 86 F7 63 64 03 02"  = "Ampliação de Certificado .Mac da Apple";
"06 0A 2A 86 48 86 F7 63 64 03 02 01"   = "Identidade .Mac da Apple";
"06 0A 2A 86 48 86 F7 63 64 03 02 02"   = "Assinatura de E-mail .Mac da Apple";
"06 0A 2A 86 48 86 F7 63 64 03 02 03"   = "Criptografia de E-mail .Mac da Apple";
"06 09 2A 86 48 86 F7 63 64 03 03"  = "Valor do Pedido de Certificado .Mac da Apple";
"06 0A 2A 86 48 86 F7 63 64 03 03 01"  = "Usuário";
"06 0A 2A 86 48 86 F7 63 64 03 03 02"  = "Senha";
"06 0A 2A 86 48 86 F7 63 64 03 03 03"  = "Host";
"06 0A 2A 86 48 86 F7 63 64 03 03 04"  = "Renovar Sinalização";
"06 0A 2A 86 48 86 F7 63 64 03 03 05"  = "Sinalização Assíncrona";

"06 08 2A 86 48 86 F7 63 64 04" = "Uso Estendido de Chave da Apple";
"06 09 2A 86 48 86 F7 63 64 04 01"  = "Autenticação de Código da Apple";
"06 0A 2A 86 48 86 F7 63 64 04 01 01"  = "Assinatura de Código da Apple (Desenvolvimento)";
"06 0A 2A 86 48 86 F7 63 64 04 01 02"  = "Autenticação de Atualização de Software da Apple";
"06 0A 2A 86 48 86 F7 63 64 04 01 03"  = "Assinatura de Códido da Apple (Reservada)";
"06 0A 2A 86 48 86 F7 63 64 04 01 04"  = "Autenticação de Recurso da Apple";
"06 09 2A 86 48 86 F7 63 64 04 02"  = "Autenticação do iChat da Apple";
"06 09 2A 86 48 86 F7 63 64 04 03"  = "Criptografia do iChat da Apple";
"06 09 2A 86 48 86 F7 63 64 04 04"  = "Identidade de Sistema da Apple";

"06 08 2A 86 48 86 F7 63 64 05" = "Políticas de Certificado da Apple";
"06 09 2A 86 48 86 F7 63 64 05 01"  = "Política de Certificados da Apple";
"06 09 2A 86 48 86 F7 63 64 05 02"  = "Política de Certificado .Mac da Apple";

/* Extended key usage */

"06 04 55 1D 25 03"					= "Autenticação de Código";

/* Intel CDSA-specific */

"06 07 60 86 48 01 86 F8 4D"	= "Intel";
"06 08 60 86 48 01 86 F8 4D 02"	= "Segurança de CDSA da Intel";

"06 09 60 86 48 01 86 F8 4D 02 01"	= "Formatos de Segurança de CDSA da Intel";
"06 0B 60 86 48 01 86 F8 4D 02 01 01 01"	= "Ampliações de Certificado X.509v3";
"06 0C 60 86 48 01 86 F8 4D 02 01 01 01 32"	= "Ampliações de Certificado Privado X.509v3";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 01"	= "Mapa de Bits da Assinatura do Sujeito";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 02"	= "Foto do Sujeito";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 03"	= "Endereço de E-mail do Sujeito";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 04"	= "Usar Isenções";

"06 0A 60 86 48 01 86 F8 4D 02 02 05"	= "Algoritmos de Segurança de CDSA da Intel";
"06 0B 60 86 48 01 86 F8 4D 02 02 05 51"	= "SHA-1 com ECDSA";

/* end */
